-- phpMyAdmin SQL Dump
-- version 4.9.1
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Сен 25 2020 г., 22:50
-- Версия сервера: 5.7.21-20-beget-5.7.21-20-1-log
-- Версия PHP: 5.6.40

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `usam12hd_66`
--

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_acl`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_acl`;
CREATE TABLE `keitaro_acl` (
  `id` int(10) UNSIGNED NOT NULL,
  `user_id` int(10) UNSIGNED NOT NULL,
  `entity_type` varchar(255) NOT NULL,
  `access_type` varchar(255) NOT NULL,
  `groups` text,
  `entities` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_acl_reports`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_acl_reports`;
CREATE TABLE `keitaro_acl_reports` (
  `id` int(10) UNSIGNED NOT NULL,
  `user_id` int(10) UNSIGNED NOT NULL,
  `columns` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_acl_resources`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_acl_resources`;
CREATE TABLE `keitaro_acl_resources` (
  `id` int(10) UNSIGNED NOT NULL,
  `user_id` int(10) UNSIGNED NOT NULL,
  `resources` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_affiliate_networks`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_affiliate_networks`;
CREATE TABLE `keitaro_affiliate_networks` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `postback_url` text,
  `offer_param` varchar(255) DEFAULT NULL,
  `state` varchar(255) DEFAULT NULL,
  `template_name` varchar(255) DEFAULT NULL,
  `created_at` datetime NOT NULL,
  `updated_at` datetime NOT NULL,
  `notes` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_api_keys`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_api_keys`;
CREATE TABLE `keitaro_api_keys` (
  `id` int(10) UNSIGNED NOT NULL,
  `key` varchar(100) NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `datetime` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_branding`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_branding`;
CREATE TABLE `keitaro_branding` (
  `id` int(20) UNSIGNED NOT NULL,
  `logo` longblob,
  `favicon` longblob
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_campaigns`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 22 2020 г., 16:56
--

DROP TABLE IF EXISTS `keitaro_campaigns`;
CREATE TABLE `keitaro_campaigns` (
  `id` int(11) NOT NULL,
  `alias` varchar(50) DEFAULT NULL,
  `name` varchar(200) DEFAULT NULL,
  `type` varchar(20) NOT NULL DEFAULT 'position',
  `uniqueness_method` varchar(20) NOT NULL DEFAULT 'ip_ua',
  `cookies_ttl` int(11) NOT NULL DEFAULT '24',
  `action_type` varchar(20) DEFAULT NULL,
  `action_payload` text,
  `action_for_bots` varchar(50) NOT NULL DEFAULT '404',
  `bot_redirect_url` text,
  `bot_text` text,
  `action_tracking_disabled` tinyint(1) UNSIGNED NOT NULL DEFAULT '0',
  `position` int(10) UNSIGNED DEFAULT NULL,
  `state` varchar(50) NOT NULL DEFAULT 'active',
  `updated_at` datetime DEFAULT NULL,
  `mode` varchar(50) DEFAULT 'general',
  `cost_type` varchar(10) DEFAULT 'CPV',
  `cost_value` decimal(10,4) DEFAULT '0.0000',
  `cost_currency` varchar(3) DEFAULT NULL,
  `group_id` int(10) UNSIGNED DEFAULT NULL,
  `bind_visitors` varchar(255) DEFAULT NULL,
  `traffic_source_id` int(10) UNSIGNED DEFAULT NULL,
  `token` varchar(50) DEFAULT NULL,
  `cost_auto` tinyint(1) UNSIGNED NOT NULL DEFAULT '0',
  `domain_id` int(10) UNSIGNED DEFAULT NULL,
  `notes` text,
  `parameters` text,
  `uniqueness_use_cookies` int(1) UNSIGNED DEFAULT '1',
  `traffic_loss` decimal(4,2) DEFAULT '0.00'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_campaigns`
--

INSERT INTO `keitaro_campaigns` (`id`, `alias`, `name`, `type`, `uniqueness_method`, `cookies_ttl`, `action_type`, `action_payload`, `action_for_bots`, `bot_redirect_url`, `bot_text`, `action_tracking_disabled`, `position`, `state`, `updated_at`, `mode`, `cost_type`, `cost_value`, `cost_currency`, `group_id`, `bind_visitors`, `traffic_source_id`, `token`, `cost_auto`, `domain_id`, `notes`, `parameters`, `uniqueness_use_cookies`, `traffic_loss`) VALUES
(1, 'kbcmfZ', 'Духи', 'position', 'ip_ua', 24, NULL, NULL, '404', NULL, NULL, 0, 9999, 'active', '2020-09-22 16:56:36', 'general', 'CPC', '0.0000', 'RUB', 0, '', 1, '4cgysqnkrzct12xkfdz9sdymndzxdw45', 1, 0, '', '{\"keyword\":{\"name\":\"keyword\",\"placeholder\":\"\",\"alias\":\"\"},\"cost\":{\"name\":\"cost\",\"placeholder\":\"\",\"alias\":\"\"},\"currency\":{\"name\":\"currency\",\"placeholder\":\"\",\"alias\":\"\"},\"external_id\":{\"name\":\"external_id\",\"placeholder\":\"\",\"alias\":\"\"},\"creative_id\":{\"name\":\"utm_creative\",\"placeholder\":\"{{ad.name}}\"},\"ad_campaign_id\":{\"name\":\"utm_campaign\",\"placeholder\":\"{{campaign.name}}\"},\"source\":{\"name\":\"utm_source\",\"placeholder\":\"{{site_source_name}}\"},\"sub_id_1\":{\"name\":\"pixel\",\"placeholder\":\"\"},\"sub_id_2\":{\"name\":\"campaign_id\",\"placeholder\":\"{{campaign.id}}\"},\"sub_id_3\":{\"name\":\"adset_id\",\"placeholder\":\"{{adset.id}}\"},\"sub_id_4\":{\"name\":\"ad_id\",\"placeholder\":\"{{ad.id}}\"},\"sub_id_5\":{\"name\":\"adset_name\",\"placeholder\":\"{{adset.name}}\"}}', 1, '0.00');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_campaign_postbacks`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_campaign_postbacks`;
CREATE TABLE `keitaro_campaign_postbacks` (
  `id` int(10) UNSIGNED NOT NULL,
  `campaign_id` int(10) UNSIGNED NOT NULL,
  `method` varchar(10) NOT NULL,
  `url` text NOT NULL,
  `statuses` varchar(255) DEFAULT NULL,
  `source` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_clicks`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 25 2020 г., 16:27
--

DROP TABLE IF EXISTS `keitaro_clicks`;
CREATE TABLE `keitaro_clicks` (
  `click_id` bigint(20) UNSIGNED NOT NULL,
  `visitor_id` bigint(20) UNSIGNED NOT NULL,
  `sub_id` varchar(255) NOT NULL,
  `ts_id` int(10) UNSIGNED DEFAULT NULL,
  `landing_id` int(10) UNSIGNED DEFAULT NULL,
  `landing_clicked` tinyint(1) UNSIGNED DEFAULT '0',
  `landing_clicked_datetime` datetime DEFAULT NULL,
  `offer_id` int(10) UNSIGNED DEFAULT NULL,
  `affiliate_network_id` int(10) UNSIGNED DEFAULT NULL,
  `datetime` datetime NOT NULL,
  `campaign_id` int(10) UNSIGNED NOT NULL,
  `parent_campaign_id` int(10) UNSIGNED DEFAULT NULL,
  `stream_id` int(10) UNSIGNED DEFAULT NULL,
  `is_unique_stream` tinyint(1) UNSIGNED DEFAULT '0',
  `is_unique_campaign` tinyint(1) UNSIGNED DEFAULT '0',
  `is_unique_global` int(1) UNSIGNED DEFAULT '0',
  `is_bot` tinyint(1) UNSIGNED DEFAULT '0',
  `is_using_proxy` tinyint(1) UNSIGNED DEFAULT '0',
  `is_empty_referrer` tinyint(1) UNSIGNED DEFAULT '0',
  `source_id` int(10) UNSIGNED NOT NULL,
  `referrer_id` int(10) NOT NULL,
  `search_engine_id` int(10) DEFAULT NULL,
  `keyword_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_1_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_2_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_3_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_4_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_5_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_6_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_7_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_8_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_9_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_10_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_11_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_12_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_13_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_14_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_15_id` int(10) UNSIGNED DEFAULT NULL,
  `extra_param_1` varchar(255) DEFAULT NULL,
  `extra_param_2` varchar(255) DEFAULT NULL,
  `extra_param_3` varchar(255) DEFAULT NULL,
  `extra_param_4` varchar(255) DEFAULT NULL,
  `extra_param_5` varchar(255) DEFAULT NULL,
  `extra_param_6` varchar(255) DEFAULT NULL,
  `extra_param_7` varchar(255) DEFAULT NULL,
  `extra_param_8` varchar(255) DEFAULT NULL,
  `extra_param_9` varchar(255) DEFAULT NULL,
  `extra_param_10` varchar(255) DEFAULT NULL,
  `lead_revenue` decimal(13,4) NOT NULL DEFAULT '0.0000',
  `rejected_revenue` decimal(13,4) NOT NULL DEFAULT '0.0000',
  `sale_revenue` decimal(13,4) NOT NULL DEFAULT '0.0000',
  `cost` decimal(13,6) NOT NULL DEFAULT '0.000000',
  `is_lead` tinyint(1) UNSIGNED DEFAULT '0',
  `is_sale` tinyint(1) UNSIGNED DEFAULT '0',
  `is_rejected` tinyint(1) UNSIGNED DEFAULT '0',
  `rebills` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `destination_id` bigint(20) UNSIGNED DEFAULT NULL,
  `creative_id_id` int(10) UNSIGNED DEFAULT NULL,
  `external_id_id` int(10) UNSIGNED DEFAULT NULL,
  `goal_1` tinyint(1) UNSIGNED DEFAULT '0',
  `goal_1_datetime` datetime DEFAULT NULL,
  `goal_2` tinyint(1) UNSIGNED DEFAULT '0',
  `goal_2_datetime` datetime DEFAULT NULL,
  `goal_3` tinyint(1) UNSIGNED DEFAULT '0',
  `goal_3_datetime` datetime DEFAULT NULL,
  `goal_4` tinyint(1) UNSIGNED DEFAULT '0',
  `goal_4_datetime` datetime DEFAULT NULL,
  `ad_campaign_id_id` int(10) UNSIGNED DEFAULT NULL,
  `x_requested_with_id` int(10) UNSIGNED DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_clicks`
--

INSERT INTO `keitaro_clicks` (`click_id`, `visitor_id`, `sub_id`, `ts_id`, `landing_id`, `landing_clicked`, `landing_clicked_datetime`, `offer_id`, `affiliate_network_id`, `datetime`, `campaign_id`, `parent_campaign_id`, `stream_id`, `is_unique_stream`, `is_unique_campaign`, `is_unique_global`, `is_bot`, `is_using_proxy`, `is_empty_referrer`, `source_id`, `referrer_id`, `search_engine_id`, `keyword_id`, `sub_id_1_id`, `sub_id_2_id`, `sub_id_3_id`, `sub_id_4_id`, `sub_id_5_id`, `sub_id_6_id`, `sub_id_7_id`, `sub_id_8_id`, `sub_id_9_id`, `sub_id_10_id`, `sub_id_11_id`, `sub_id_12_id`, `sub_id_13_id`, `sub_id_14_id`, `sub_id_15_id`, `extra_param_1`, `extra_param_2`, `extra_param_3`, `extra_param_4`, `extra_param_5`, `extra_param_6`, `extra_param_7`, `extra_param_8`, `extra_param_9`, `extra_param_10`, `lead_revenue`, `rejected_revenue`, `sale_revenue`, `cost`, `is_lead`, `is_sale`, `is_rejected`, `rebills`, `destination_id`, `creative_id_id`, `external_id_id`, `goal_1`, `goal_1_datetime`, `goal_2`, `goal_2_datetime`, `goal_3`, `goal_3_datetime`, `goal_4`, `goal_4_datetime`, `ad_campaign_id_id`, `x_requested_with_id`) VALUES
(1, 1, '1pucf8f5f674b197a6ce', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:29:13', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(2, 1, '1pucf8f5f674b3c73ace', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:29:48', 1, 0, 3, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(3, 1, '1pucf8f5f674b3fe68b7', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:29:51', 1, 0, 3, 0, 0, 0, 0, 0, 0, 2, 2, 2, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(4, 1, '1pucf8f5f674b426c50c', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:29:54', 1, 0, 3, 0, 0, 0, 0, 0, 0, 2, 2, 2, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(5, 1, '1pucf8f5f674b560c6e9', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:30:13', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(6, 1, '1pucf8f5f674b7889680', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:30:48', 1, 0, 3, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(7, 1, '1pucf8f5f674b7bf0807', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:30:51', 1, 0, 3, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(8, 1, '1pucf8f5f674b7f04d26', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:30:54', 1, 0, 3, 0, 0, 0, 0, 0, 0, 2, 2, 2, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(9, 1, '1pucf8f5f674b82b24ce', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:30:58', 1, 0, 3, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(10, 1, '1pucf8f5f674b8a82354', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:31:06', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(11, 1, '1pucf8f5f674bd7ddbf2', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:32:23', 1, 0, 3, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(12, 1, '1pucf8f5f674bdef2646', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:32:30', 1, 0, 3, 0, 0, 0, 0, 0, 0, 2, 2, 2, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(13, 2, '3f4hd55f674c078eb42', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:33:11', 1, 0, 2, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 2, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(14, 1, '1pucf8f5f674c5f72a93', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:34:39', 1, 0, 3, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(15, 3, '2cmmu5d5f674c9705248', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:35:34', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(16, 4, '2l7461q5f674c9b967a4', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:35:39', 1, 0, 2, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 2, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(17, 5, '2gh4v7u5f674cf6a3856', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:37:10', 1, 0, 2, 1, 1, 1, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 2, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(18, 6, '2aejrht5f674dc5a894c', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:40:37', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(19, 6, '2aejrht5f674dc6a2c12', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:40:38', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(20, 7, '37ja4ra5f674de634766', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:41:10', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(21, 8, '1jnslb75f674dee10819', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:41:18', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(22, 9, '3cj85el5f674e3885316', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:42:32', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(23, 10, '3q6n8dc5f674ea5831b3', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:44:21', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(24, 11, 'lvdnmq5f674ea8102b8', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:44:24', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(25, 6, '2aejrht5f674ea97ae60', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:44:25', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(26, 6, '2aejrht5f674ea9c34ff', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:44:25', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(27, 5, '2gh4v7u5f674eb517038', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:44:37', 1, 0, 2, 1, 1, 1, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 2, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(28, 12, '3d6rkla5f674ec226d1f', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:44:50', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(29, 1, '1pucf8f5f674eebaa9f6', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:45:31', 1, 0, 3, 1, 1, 1, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(30, 1, '1pucf8f5f674eec8b2c4', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:45:32', 1, 0, 3, 1, 1, 1, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(31, 6, '2aejrht5f674f29a30fa', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:46:33', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(32, 6, '2aejrht5f674f29da7bf', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:46:33', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(33, 5, '2gh4v7u5f6750c1526a7', 1, 0, 0, NULL, 0, 0, '2020-09-20 12:53:21', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 2, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(34, 5, '2gh4v7u5f675594adb00', 1, 0, 0, NULL, 0, 0, '2020-09-20 13:13:56', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 2, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(35, 5, '2gh4v7u5f6755e291e97', 1, 0, 0, NULL, 0, 0, '2020-09-20 13:15:14', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 2, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(36, 5, '2gh4v7u5f6755fc9f1a0', 1, 0, 0, NULL, 0, 0, '2020-09-20 13:15:40', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 2, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(37, 13, '3jjm5595f67561c8a17f', 1, 0, 0, NULL, 0, 0, '2020-09-20 13:16:12', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(38, 14, 'er4aj75f675bbc9d39d', 1, 0, 0, NULL, 0, 0, '2020-09-20 13:40:12', 1, 0, 3, 1, 1, 1, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(39, 14, 'er4aj75f675bcf82727', 1, 0, 0, NULL, 0, 0, '2020-09-20 13:40:31', 1, 0, 3, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(40, 15, '2044fvv5f67698c4b3a0', 1, 0, 0, NULL, 0, 0, '2020-09-20 14:39:08', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(41, 1, '1pucf8f5f676e1885c83', 1, 0, 0, NULL, 0, 0, '2020-09-20 14:58:32', 1, 0, 2, 1, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(42, 1, '1pucf8f5f676e18bf1ed', 1, 0, 0, NULL, 0, 0, '2020-09-20 14:58:32', 1, 0, 2, 1, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(43, 16, '30d48mj5f677dd061cc1', 1, 0, 0, NULL, 0, 0, '2020-09-20 16:05:36', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(44, 1, '1pucf8f5f6786421e1fb', 1, 0, 0, NULL, 0, 0, '2020-09-20 16:41:38', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(45, 1, '1pucf8f5f6786426edb8', 1, 0, 0, NULL, 0, 0, '2020-09-20 16:41:38', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(46, 1, '1pucf8f5f67879914bf2', 1, 0, 0, NULL, 0, 0, '2020-09-20 16:47:21', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(47, 1, '1pucf8f5f6787994fb00', 1, 0, 0, NULL, 0, 0, '2020-09-20 16:47:21', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(48, 17, '2knbc9r5f6787edd4c2c', 1, 0, 0, NULL, 0, 0, '2020-09-20 16:48:45', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(49, 18, '3l7p5ut5f6787ee3905b', 1, 0, 0, NULL, 0, 0, '2020-09-20 16:48:46', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(50, 19, '3irdo5r5f6787efc160d', 1, 0, 0, NULL, 0, 0, '2020-09-20 16:48:47', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(51, 19, '3irdo5r5f6787efcba72', 1, 0, 0, NULL, 0, 0, '2020-09-20 16:48:47', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(52, 20, '3jr5ulc5f6787f028503', 1, 0, 0, NULL, 0, 0, '2020-09-20 16:48:48', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(53, 21, '3v1brrt5f6787f0d5ccd', 1, 0, 0, NULL, 0, 0, '2020-09-20 16:48:48', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(54, 18, '3l7p5ut5f6787f124245', 1, 0, 0, NULL, 0, 0, '2020-09-20 16:48:49', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(55, 22, '3mg4o875f6787f1bf780', 1, 0, 0, NULL, 0, 0, '2020-09-20 16:48:49', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(56, 23, '16p5sb35f6787f2c25c4', 1, 0, 0, NULL, 0, 0, '2020-09-20 16:48:50', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(57, 24, '2f898kr5f6787f2c25c4', 1, 0, 0, NULL, 0, 0, '2020-09-20 16:48:50', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(58, 25, '3pb50ti5f6787f2c4474', 1, 0, 0, NULL, 0, 0, '2020-09-20 16:48:50', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(59, 3, '2cmmu5d5f6787f3b9f26', 1, 0, 0, NULL, 0, 0, '2020-09-20 16:48:51', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(60, 26, '368tpjh5f6787f3b9f3e', 1, 0, 0, NULL, 0, 0, '2020-09-20 16:48:51', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(61, 22, '3mg4o875f6787f3be0fc', 1, 0, 0, NULL, 0, 0, '2020-09-20 16:48:51', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(62, 27, '32ff1cj5f67897aba20a', 1, 0, 0, NULL, 0, 0, '2020-09-20 16:55:22', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(63, 28, 't8j6045f679664b878b', 1, 0, 0, NULL, 0, 0, '2020-09-20 17:50:28', 1, 0, 2, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(64, 28, 't8j6045f6796b05ad8f', 1, 0, 0, NULL, 0, 0, '2020-09-20 17:51:44', 1, 0, 2, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(65, 28, 't8j6045f679712e5618', 1, 0, 0, NULL, 0, 0, '2020-09-20 17:53:22', 1, 0, 2, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(66, 29, '2j5q99g5f67a1af342fc', 1, 0, 0, NULL, 0, 0, '2020-09-20 18:38:39', 1, 0, 2, 1, 1, 1, 0, 0, 1, 4, 1, 1, 1, 2, 3, 4, 5, 6, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 2, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 2, 1),
(67, 30, 'uusqof5f67aea0adfe2', 1, 0, 0, NULL, 0, 0, '2020-09-20 19:33:52', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(68, 31, '3r4ravt5f67dc85997a1', 1, 0, 0, NULL, 0, 0, '2020-09-20 22:49:41', 1, 0, 2, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(69, 32, '3i9fmli5f67de2fbc5cb', 1, 0, 0, NULL, 0, 0, '2020-09-20 22:56:47', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(70, 32, '3i9fmli5f67de30259e1', 1, 0, 0, NULL, 0, 0, '2020-09-20 22:56:48', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(71, 32, '3i9fmli5f67de30ca956', 1, 0, 0, NULL, 0, 0, '2020-09-20 22:56:48', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(72, 33, '36l0c2f5f67f028acef2', 1, 0, 0, NULL, 0, 0, '2020-09-21 00:13:28', 1, 0, 2, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(73, 34, 'neo6a05f67f7397b28a', 1, 0, 0, NULL, 0, 0, '2020-09-21 00:43:37', 1, 0, 2, 1, 1, 1, 0, 0, 1, 4, 1, 1, 1, 2, 3, 4, 5, 6, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 2, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 2, 1),
(74, 35, '3km2b925f67fc50c7f62', 1, 0, 0, NULL, 0, 0, '2020-09-21 01:05:20', 1, 0, 2, 1, 1, 1, 0, 0, 1, 4, 1, 1, 1, 2, 3, 4, 5, 6, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 2, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 2, 1),
(75, 36, '2hq95op5f68027133e82', 1, 0, 0, NULL, 0, 0, '2020-09-21 01:31:29', 1, 0, 2, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(76, 36, '2hq95op5f68027b15a60', 1, 0, 0, NULL, 0, 0, '2020-09-21 01:31:39', 1, 0, 2, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(77, 36, '2hq95op5f680280aea84', 1, 0, 0, NULL, 0, 0, '2020-09-21 01:31:44', 1, 0, 2, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(78, 36, '2hq95op5f6802876977d', 1, 0, 0, NULL, 0, 0, '2020-09-21 01:31:51', 1, 0, 2, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(79, 37, '2b2q7745f68078b3094b', 1, 0, 0, NULL, 0, 0, '2020-09-21 01:53:15', 1, 0, 3, 1, 1, 1, 0, 0, 0, 1, 4, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(80, 5, '2gh4v7u5f681a5a883b5', 1, 0, 0, NULL, 0, 0, '2020-09-21 03:13:30', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(81, 38, '37qa8gu5f681ded19aa2', 1, 0, 0, NULL, 0, 0, '2020-09-21 03:28:45', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(82, 39, '26f22fj5f682ce4b2293', 1, 0, 0, NULL, 0, 0, '2020-09-21 04:32:36', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(83, 40, '2n4skcd5f68437fdc92a', 1, 0, 0, NULL, 0, 0, '2020-09-21 06:09:03', 1, 0, 2, 1, 1, 1, 0, 0, 0, 5, 5, 4, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(84, 41, 'dqib1k5f6853b19e508', 1, 0, 0, NULL, 0, 0, '2020-09-21 07:18:09', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(85, 42, 'un045v5f68552f368dc', 1, 0, 0, NULL, 0, 0, '2020-09-21 07:24:31', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(86, 43, '4787lo5f68772106036', 1, 0, 0, NULL, 0, 0, '2020-09-21 09:49:20', 1, 0, 2, 1, 1, 1, 0, 0, 1, 4, 1, 1, 1, 2, 3, 4, 5, 6, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 2, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 2, 1),
(87, 44, '1esgm7o5f68aeb4e4ed3', 1, 0, 0, NULL, 0, 0, '2020-09-21 13:46:28', 1, 0, 2, 1, 1, 1, 0, 0, 0, 5, 5, 4, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(88, 45, '13shg395f68b070edf7c', 1, 0, 0, NULL, 0, 0, '2020-09-21 13:53:52', 1, 0, 2, 1, 1, 1, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(89, 1, '1pucf8f5f68c05207402', 1, 0, 0, NULL, 0, 0, '2020-09-21 15:01:37', 1, 0, 2, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(90, 1, '1pucf8f5f68c05283480', 1, 0, 0, NULL, 0, 0, '2020-09-21 15:01:38', 1, 0, 2, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(91, 1, '1pucf8f5f68c0f4289f5', 1, 0, 0, NULL, 0, 0, '2020-09-21 15:04:20', 1, 0, 2, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(92, 1, '1pucf8f5f68c15797ace', 1, 0, 0, NULL, 0, 0, '2020-09-21 15:05:59', 1, 0, 2, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(93, 1, '1pucf8f5f68c17018784', 1, 0, 0, NULL, 0, 0, '2020-09-21 15:06:24', 1, 0, 2, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(94, 5, '2gh4v7u5f68c1ce4f629', 1, 0, 0, NULL, 0, 0, '2020-09-21 15:07:58', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(95, 1, '1pucf8f5f68c300192ae', 1, 0, 0, NULL, 0, 0, '2020-09-21 15:13:04', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(96, 1, '1pucf8f5f68c3005c13e', 1, 0, 0, NULL, 0, 0, '2020-09-21 15:13:04', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(97, 1, '1pucf8f5f68c49c01692', 1, 0, 0, NULL, 0, 0, '2020-09-21 15:19:55', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(98, 1, '1pucf8f5f68c49c3ba35', 1, 0, 0, NULL, 0, 0, '2020-09-21 15:19:56', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(99, 1, '1pucf8f5f68c6a1aebc8', 1, 0, 0, NULL, 0, 0, '2020-09-21 15:28:33', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(100, 1, '1pucf8f5f68c6a1eb0d6', 1, 0, 0, NULL, 0, 0, '2020-09-21 15:28:33', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(101, 46, '139pdml5f68c7f59ecc7', 1, 0, 0, NULL, 0, 0, '2020-09-21 15:34:13', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(102, 47, '11gtvs65f68d779808e3', 1, 0, 0, NULL, 0, 0, '2020-09-21 16:40:25', 1, 0, 2, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(103, 48, '10sic7i5f68d779990d8', 1, 0, 0, NULL, 0, 0, '2020-09-21 16:40:25', 1, 0, 2, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(104, 49, '26ieuog5f68d78288e19', 1, 0, 0, NULL, 0, 0, '2020-09-21 16:40:34', 1, 0, 2, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(105, 47, '11gtvs65f68d787ed597', 1, 0, 0, NULL, 0, 0, '2020-09-21 16:40:39', 1, 0, 2, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(106, 50, '1ir39575f68dd2fe92d0', 1, 0, 0, NULL, 0, 0, '2020-09-21 17:04:47', 1, 0, 2, 1, 1, 1, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(107, 1, '1pucf8f5f68e1a28cf26', 1, 0, 0, NULL, 0, 0, '2020-09-21 17:23:46', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(108, 1, '1pucf8f5f68e1a2d11ef', 1, 0, 0, NULL, 0, 0, '2020-09-21 17:23:46', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(109, 1, '1pucf8f5f68e7e92ec71', 1, 0, 0, NULL, 0, 0, '2020-09-21 17:50:33', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(110, 1, '1pucf8f5f68e7e97affd', 1, 0, 0, NULL, 0, 0, '2020-09-21 17:50:33', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(111, 1, '1pucf8f5f68e82fde012', 1, 0, 0, NULL, 0, 0, '2020-09-21 17:51:43', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(112, 1, '1pucf8f5f68e830518f0', 1, 0, 0, NULL, 0, 0, '2020-09-21 17:51:44', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(113, 51, '1855c3o5f690af666b96', 1, 0, 0, NULL, 0, 0, '2020-09-21 20:20:06', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(114, 52, '17q9shf5f691efbedd63', 1, 0, 0, NULL, 0, 0, '2020-09-21 21:45:31', 1, 0, 2, 1, 1, 1, 0, 0, 1, 4, 1, 1, 1, 2, 3, 4, 5, 6, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 2, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 2, 1),
(115, 53, '2celenr5f692f13938c7', 1, 0, 0, NULL, 0, 0, '2020-09-21 22:54:11', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(116, 54, '2sbc1r85f694784362a4', 1, 0, 0, NULL, 0, 0, '2020-09-22 00:38:28', 1, 0, 3, 0, 0, 0, 1, 0, 0, 5, 5, 4, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(117, 55, 'uk7teb5f694e45d4ec9', 1, 0, 0, NULL, 0, 0, '2020-09-22 01:07:17', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(118, 56, '23kjegg5f695194c6480', 1, 0, 0, NULL, 0, 0, '2020-09-22 01:21:24', 1, 0, 2, 1, 1, 1, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(119, 56, '23kjegg5f6951a91d698', 1, 0, 0, NULL, 0, 0, '2020-09-22 01:21:45', 1, 0, 2, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(120, 57, '1viv7ba5f698af9b04c0', 1, 0, 0, NULL, 0, 0, '2020-09-22 05:26:17', 1, 0, 3, 1, 1, 1, 0, 0, 1, 6, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(121, 42, 'un045v5f698f65f1044', 1, 0, 0, NULL, 0, 0, '2020-09-22 05:45:09', 1, 0, 3, 0, 0, 0, 1, 0, 0, 1, 6, 4, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(122, 58, '3p3dblr5f69941c3c027', 1, 0, 0, NULL, 0, 0, '2020-09-22 06:05:16', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(123, 59, '128s78i5f6a1e43c9c8f', 1, 0, 0, NULL, 0, 0, '2020-09-22 15:54:43', 1, 0, 2, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(124, 60, '7lu8s05f6a3b870c93f', 1, 0, 0, NULL, 0, 0, '2020-09-22 17:59:34', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(125, 37, '2b2q7745f6a3f61877ca', 1, 0, 0, NULL, 0, 0, '2020-09-22 18:16:01', 1, 0, 3, 1, 1, 1, 0, 0, 0, 1, 4, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(126, 61, '38cfkco5f6a4b092a656', 1, 0, 0, NULL, 0, 0, '2020-09-22 19:05:45', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(127, 61, '38cfkco5f6a4b1133353', 1, 0, 0, NULL, 0, 0, '2020-09-22 19:05:53', 1, 0, 3, 0, 0, 0, 0, 0, 0, 1, 6, 4, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(128, 58, '3p3dblr5f6a4e91866ce', 1, 0, 0, NULL, 0, 0, '2020-09-22 19:20:49', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(129, 62, '2kssuj75f6ad57f7c9d7', 1, 0, 0, NULL, 0, 0, '2020-09-23 04:56:31', 1, 0, 2, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(130, 63, '1bl72ji5f6ad5a563f39', 1, 0, 0, NULL, 0, 0, '2020-09-23 04:57:09', 1, 0, 2, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(131, 64, '129b6tb5f6af65f53af8', 1, 0, 0, NULL, 0, 0, '2020-09-23 07:16:47', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(132, 65, '19vfkqh5f6af6a8a38fe', 1, 0, 0, NULL, 0, 0, '2020-09-23 07:18:00', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(133, 58, '3p3dblr5f6af6e16c91a', 1, 0, 0, NULL, 0, 0, '2020-09-23 07:18:57', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(134, 66, 'm5m5l15f6b439b826e7', 1, 0, 0, NULL, 0, 0, '2020-09-23 12:46:19', 1, 0, 2, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(135, 67, '7r5b0a5f6b668ab88b8', 1, 0, 0, NULL, 0, 0, '2020-09-23 15:15:22', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(136, 68, '12n84oi5f6b6d6c73fac', 1, 0, 0, NULL, 0, 0, '2020-09-23 15:44:44', 1, 0, 2, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(137, 69, '19hb8oi5f6b897a7c3ce', 1, 0, 0, NULL, 0, 0, '2020-09-23 17:44:26', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(138, 70, '3fhmnu35f6b91b231be2', 1, 0, 0, NULL, 0, 0, '2020-09-23 18:19:30', 1, 0, 2, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(139, 70, '3fhmnu35f6b9580228d8', 1, 0, 0, NULL, 0, 0, '2020-09-23 18:35:44', 1, 0, 2, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(140, 71, '3i04nfi5f6c17924c2f1', 1, 0, 0, NULL, 0, 0, '2020-09-24 03:50:42', 1, 0, 2, 1, 1, 1, 0, 0, 0, 5, 5, 4, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(141, 72, '2j5cjsb5f6c1c7a8ec60', 1, 0, 0, NULL, 0, 0, '2020-09-24 04:11:38', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(142, 73, '3csb8j85f6c492fecd5e', 1, 0, 0, NULL, 0, 0, '2020-09-24 07:22:23', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(143, 74, 'hg81gj5f6c493195ae7', 1, 0, 0, NULL, 0, 0, '2020-09-24 07:22:25', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(144, 75, '36plamf5f6c683c8968c', 1, 0, 0, NULL, 0, 0, '2020-09-24 09:34:52', 1, 0, 2, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(145, 37, '2b2q7745f6c7b2640c74', 1, 0, 0, NULL, 0, 0, '2020-09-24 10:55:34', 1, 0, 3, 1, 1, 1, 0, 0, 0, 1, 4, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(146, 76, 'hhbvu55f6c84ed31063', 1, 0, 0, NULL, 0, 0, '2020-09-24 11:37:17', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(147, 76, 'hhbvu55f6c9a94dde29', 1, 0, 0, NULL, 0, 0, '2020-09-24 13:09:40', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(148, 70, '3fhmnu35f6cce4804312', 1, 0, 0, NULL, 0, 0, '2020-09-24 16:50:15', 1, 0, 2, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(149, 77, 'topej25f6cd8727969c', 1, 0, 0, NULL, 0, 0, '2020-09-24 17:33:38', 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(150, 78, '24u5k3o5f6d42145a7a8', 1, 0, 0, NULL, 0, 0, '2020-09-25 01:04:20', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(151, 79, '3s6g4kp5f6d47086dc35', 1, 0, 0, NULL, 0, 0, '2020-09-25 01:25:28', 1, 0, 3, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(152, 79, '3s6g4kp5f6d470a8b8d0', 1, 0, 0, NULL, 0, 0, '2020-09-25 01:25:30', 1, 0, 3, 0, 0, 0, 0, 0, 0, 1, 7, 2, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(153, 42, 'un045v5f6d4d65bf374', 1, 0, 0, NULL, 0, 0, '2020-09-25 01:52:37', 1, 0, 3, 0, 0, 0, 1, 0, 0, 1, 6, 4, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 1, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(154, 80, '28ielpb5f6dc635d1a2a', 1, 0, 0, NULL, 0, 0, '2020-09-25 10:28:05', 1, 0, 2, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(155, 81, '3n6hlh85f6ddfb6160c5', 1, 0, 0, NULL, 0, 0, '2020-09-25 12:16:53', 1, 0, 2, 1, 1, 1, 0, 0, 0, 7, 8, 5, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1),
(156, 82, '1hod0ud5f6e1a2fb5dfd', 1, 0, 0, NULL, 0, 0, '2020-09-25 16:26:23', 1, 0, 2, 1, 1, 1, 0, 0, 0, 5, 5, 4, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '', '', '', '', '', '', '', '', '', '', '0.0000', '0.0000', '0.0000', '0.000000', 0, 0, 0, 0, 3, 1, 1, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 1, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_click_links`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_click_links`;
CREATE TABLE `keitaro_click_links` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `sub_id` varchar(255) NOT NULL,
  `parent_sub_id` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_command_queue`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_command_queue`;
CREATE TABLE `keitaro_command_queue` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` date DEFAULT NULL,
  `payload` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_conversions`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_conversions`;
CREATE TABLE `keitaro_conversions` (
  `id` int(10) UNSIGNED NOT NULL,
  `campaign_id` int(11) DEFAULT NULL,
  `stream_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id` varchar(30) NOT NULL,
  `tid` varchar(100) DEFAULT NULL,
  `status` varchar(100) DEFAULT NULL,
  `previous_status` varchar(100) DEFAULT NULL,
  `original_status` varchar(100) DEFAULT NULL,
  `se` varchar(100) DEFAULT NULL,
  `sub_id_1` varchar(255) DEFAULT NULL,
  `sub_id_2` varchar(255) DEFAULT NULL,
  `sub_id_3` varchar(255) DEFAULT NULL,
  `sub_id_4` varchar(255) DEFAULT NULL,
  `extra_param_1` varchar(255) DEFAULT NULL,
  `extra_param_2` varchar(255) DEFAULT NULL,
  `extra_param_3` varchar(255) DEFAULT NULL,
  `extra_param_4` varchar(255) DEFAULT NULL,
  `extra_param_5` varchar(255) DEFAULT NULL,
  `extra_param_6` varchar(255) DEFAULT NULL,
  `extra_param_7` varchar(255) DEFAULT NULL,
  `revenue` decimal(10,4) DEFAULT '0.0000',
  `cost` decimal(10,4) DEFAULT '0.0000',
  `browser` varchar(150) DEFAULT NULL,
  `os` varchar(100) DEFAULT NULL,
  `country` varchar(2) DEFAULT NULL,
  `region` varchar(6) DEFAULT NULL,
  `city` varchar(60) DEFAULT NULL,
  `user_agent` text,
  `ip` bigint(11) DEFAULT NULL,
  `keyword` varchar(250) DEFAULT NULL,
  `source` varchar(250) DEFAULT NULL,
  `isp` varchar(50) DEFAULT NULL,
  `operator` varchar(50) DEFAULT NULL,
  `connection_type` varchar(10) DEFAULT NULL,
  `device_type` varchar(30) DEFAULT NULL,
  `device_model` varchar(200) DEFAULT NULL,
  `params` text,
  `datetime` datetime NOT NULL,
  `entry_date` date NOT NULL,
  `processed` int(1) UNSIGNED NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_conversions_2`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_conversions_2`;
CREATE TABLE `keitaro_conversions_2` (
  `conversion_id` int(10) UNSIGNED NOT NULL,
  `visitor_id` bigint(20) UNSIGNED DEFAULT NULL,
  `campaign_id` int(11) DEFAULT NULL,
  `stream_id` int(10) UNSIGNED DEFAULT NULL,
  `ts_id` int(10) UNSIGNED DEFAULT NULL,
  `landing_id` int(10) UNSIGNED DEFAULT NULL,
  `offer_id` int(10) UNSIGNED DEFAULT NULL,
  `affiliate_network_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id` varchar(255) NOT NULL,
  `click_id` int(10) UNSIGNED DEFAULT NULL,
  `tid` varchar(100) DEFAULT NULL,
  `click_datetime` datetime NOT NULL,
  `postback_datetime` datetime NOT NULL,
  `status` varchar(100) DEFAULT NULL,
  `previous_status` varchar(100) DEFAULT NULL,
  `original_status` varchar(100) DEFAULT NULL,
  `source_id` int(10) UNSIGNED DEFAULT NULL,
  `referrer_id` int(10) UNSIGNED DEFAULT NULL,
  `search_engine_id` int(10) DEFAULT NULL,
  `keyword_id` int(10) UNSIGNED DEFAULT NULL,
  `screen_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_1_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_2_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_3_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_4_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_5_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_6_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_7_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_8_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_9_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_10_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_11_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_12_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_13_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_14_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id_15_id` int(10) UNSIGNED DEFAULT NULL,
  `extra_param_1` varchar(255) DEFAULT NULL,
  `extra_param_2` varchar(255) DEFAULT NULL,
  `extra_param_3` varchar(255) DEFAULT NULL,
  `extra_param_4` varchar(255) DEFAULT NULL,
  `extra_param_5` varchar(255) DEFAULT NULL,
  `extra_param_6` varchar(255) DEFAULT NULL,
  `extra_param_7` varchar(255) DEFAULT NULL,
  `extra_param_8` varchar(255) DEFAULT NULL,
  `extra_param_9` varchar(255) DEFAULT NULL,
  `extra_param_10` varchar(255) DEFAULT NULL,
  `revenue` decimal(10,4) DEFAULT '0.0000',
  `cost` decimal(13,6) DEFAULT '0.000000',
  `params` text,
  `is_processed` int(1) UNSIGNED NOT NULL DEFAULT '0',
  `creative_id_id` int(10) UNSIGNED DEFAULT NULL,
  `external_id_id` int(10) UNSIGNED DEFAULT NULL,
  `ad_campaign_id_id` int(10) UNSIGNED DEFAULT NULL,
  `sale_datetime` datetime DEFAULT NULL,
  `x_requested_with_id` int(10) UNSIGNED DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_country_profiles`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_country_profiles`;
CREATE TABLE `keitaro_country_profiles` (
  `id` int(11) NOT NULL,
  `name` varchar(200) NOT NULL,
  `countries` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_country_profiles`
--

INSERT INTO `keitaro_country_profiles` (`id`, `name`, `countries`) VALUES
(1, 'USA and Canada', 'US CA'),
(2, 'West Europe', 'GB DE FR IT AT CH ES NL BE DK SE NO PT FI IS IE LI LU MC AD GI GR MT SM VA FO CY'),
(3, 'Europe', 'AL GB DE FR IT AT CH ES NL BE DK SE NO PT FI IS IE LI LU MC AD GI GR MT SM VA FO CY BY BA BG HR CZ EE HU LV LT MK MD ME PL RO RS SK SI'),
(4, 'exUSSR', 'AM AZ BY EE GE KZ KG LV LT MD RU TJ TM UA UZ'),
(5, 'English-Speaking', 'US GB CA AU NZ IE ZA SG JM TT GY BB'),
(6, 'German-Speaking', 'AT CH LI LU DK'),
(7, 'French-Speaking', 'FR MC LU CD MG CI CM BF NE SN ML BE'),
(8, 'Portuguese-Speaking', 'AO BR PT CV GW MZ ST GQ MU'),
(9, 'Spanish-Speaking', 'CO ES AR MX VE PE CL EC GT CU DO HN BO SV NI PY CR UY PA GQ'),
(10, 'Italian-Speaking', 'CH SM VA MT HR SI'),
(11, 'North America', 'AI AG AW BS BB BZ BM VI CA KY CR CU DO SV GL GD GP GT HT HN JM MQ MX MS NL NI PA PR KN LC PM VC TT TC US'),
(12, 'USA, Canada and Europe', 'US CA AL GB DE FR IT AT CH ES NL BE DK SE NO PT FI IS IE LI LU MC AD GI GR MT SM VA FO CY BY BA BG HR CZ EE HU LV LT MK MD ME PL RO RS SK SI'),
(13, 'English-Speaking and West Europe', 'US GB CA AU NZ IE ZA SG JM TT GY BB DE FR IT AT CH ES NL BE DK SE NO PT FI IS LI LU MC AD GI GR MT SM VA FO CY'),
(14, 'English-Speaking and Europe', 'US GB CA AU NZ IE ZA SG JM TT GY BB AL DE FR IT AT CH ES NL BE DK SE NO PT FI IS LI LU MC AD GI GR MT SM VA FO CY BY BA BG HR CZ EE HU LV LT MK MD ME PL RO RS SK SI');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_cron_status`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 25 2020 г., 19:50
--

DROP TABLE IF EXISTS `keitaro_cron_status`;
CREATE TABLE `keitaro_cron_status` (
  `id` int(10) UNSIGNED NOT NULL,
  `task_name` varchar(40) NOT NULL,
  `executed_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_cron_status`
--

INSERT INTO `keitaro_cron_status` (`id`, `task_name`, `executed_at`) VALUES
(1, 'ExecuteDelayedCommand', '2020-09-25 19:50:02'),
(2, 'CheckTsTask', '2020-09-25 17:56:01'),
(3, 'CheckDomains', '2020-09-25 19:50:02'),
(4, 'PruneMysqlSessions', '2020-09-25 17:31:01'),
(5, 'PruneClicks', '2020-09-25 11:31:01'),
(6, 'PruneData', '2020-09-25 11:31:01'),
(7, 'SyncCostsWithFacebook', '2020-09-25 19:50:02'),
(8, 'SyncConversionAppsFlyer', '2020-09-25 19:50:02'),
(9, 'RunTriggersTask', '2020-09-25 19:50:02'),
(10, 'DeleteOldTriggers', '2020-09-25 11:31:01'),
(11, 'LogCleaner', '2020-09-25 19:23:01'),
(12, 'PruneOldFiles', '2020-09-25 18:57:01'),
(13, 'PruneArchive', '2020-09-25 19:30:02'),
(14, 'PruneReferences', '2020-09-21 00:00:01');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_daily_entries`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_daily_entries`;
CREATE TABLE `keitaro_daily_entries` (
  `entry_id` bigint(20) UNSIGNED NOT NULL,
  `date` date NOT NULL,
  `campaign_id` int(10) UNSIGNED NOT NULL,
  `field_name` varchar(100) NOT NULL,
  `field_value` int(10) UNSIGNED NOT NULL,
  `clicks` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `unique_clicks` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `bots` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `mobiles` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `empty_referrers` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `proxies` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `conversions` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `leads` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `sales` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `rejected` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `rebills` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `revenue` decimal(13,4) UNSIGNED NOT NULL DEFAULT '0.0000',
  `cost` decimal(13,4) UNSIGNED NOT NULL DEFAULT '0.0000'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_delayed_tasks`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_delayed_tasks`;
CREATE TABLE `keitaro_delayed_tasks` (
  `id` int(10) UNSIGNED NOT NULL,
  `data` blob NOT NULL,
  `datetime` datetime DEFAULT NULL,
  `status` varchar(255) NOT NULL,
  `error_message` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_domains`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_domains`;
CREATE TABLE `keitaro_domains` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `is_ssl` tinyint(1) NOT NULL,
  `network_status` varchar(255) DEFAULT NULL,
  `default_campaign_id` int(10) UNSIGNED DEFAULT NULL,
  `state` varchar(255) DEFAULT NULL,
  `created_at` datetime NOT NULL,
  `updated_at` datetime NOT NULL,
  `wildcard` tinyint(1) NOT NULL DEFAULT '0',
  `catch_not_found` int(1) DEFAULT '1',
  `notes` text,
  `error_description` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_favourite_reports`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_favourite_reports`;
CREATE TABLE `keitaro_favourite_reports` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(50) NOT NULL,
  `user_id` int(10) UNSIGNED NOT NULL,
  `is_shared` tinyint(1) UNSIGNED DEFAULT '0',
  `payload` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_favourite_streams`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_favourite_streams`;
CREATE TABLE `keitaro_favourite_streams` (
  `id` int(20) UNSIGNED NOT NULL,
  `user_id` int(10) UNSIGNED NOT NULL,
  `stream_id` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_groups`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_groups`;
CREATE TABLE `keitaro_groups` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(100) NOT NULL,
  `position` int(10) UNSIGNED NOT NULL,
  `type` varchar(255) DEFAULT 'campaign'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ips`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_ips`;
CREATE TABLE `keitaro_ips` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `campaign_id` int(11) DEFAULT NULL,
  `ip` int(10) UNSIGNED NOT NULL,
  `group_id` int(11) DEFAULT NULL,
  `stream_id` int(11) NOT NULL DEFAULT '0',
  `date` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ip_sessions`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_ip_sessions`;
CREATE TABLE `keitaro_ip_sessions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `ip` int(11) UNSIGNED NOT NULL,
  `expires_at` datetime NOT NULL,
  `payload` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_labels`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_labels`;
CREATE TABLE `keitaro_labels` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `campaign_id` int(12) UNSIGNED DEFAULT NULL,
  `label_name` varchar(50) NOT NULL,
  `ref_name` varchar(100) NOT NULL,
  `ref_id` int(12) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_landings`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_landings`;
CREATE TABLE `keitaro_landings` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `action_payload` text,
  `group_id` bigint(20) UNSIGNED DEFAULT NULL,
  `offer_count` int(10) NOT NULL DEFAULT '1',
  `state` varchar(255) DEFAULT NULL,
  `created_at` datetime NOT NULL,
  `updated_at` datetime NOT NULL,
  `landing_type` varchar(10) DEFAULT 'external',
  `notes` text,
  `action_options` text,
  `action_type` varchar(50) DEFAULT NULL,
  `url` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_monitoring_history`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_monitoring_history`;
CREATE TABLE `keitaro_monitoring_history` (
  `id` int(10) UNSIGNED NOT NULL,
  `level` varchar(10) NOT NULL,
  `stream_id` int(10) UNSIGNED NOT NULL,
  `trigger_id` int(11) NOT NULL,
  `message` text NOT NULL,
  `date` datetime NOT NULL,
  `state` enum('unread','read') NOT NULL DEFAULT 'read'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_offers`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 20 2020 г., 12:08
--

DROP TABLE IF EXISTS `keitaro_offers`;
CREATE TABLE `keitaro_offers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `group_id` bigint(20) UNSIGNED DEFAULT NULL,
  `action_payload` text,
  `affiliate_network_id` bigint(20) UNSIGNED DEFAULT NULL,
  `payout_value` decimal(10,4) DEFAULT '0.0000',
  `payout_currency` varchar(3) DEFAULT NULL,
  `payout_type` varchar(10) DEFAULT NULL,
  `state` varchar(255) DEFAULT NULL,
  `created_at` datetime NOT NULL,
  `updated_at` datetime NOT NULL,
  `payout_auto` tinyint(1) UNSIGNED NOT NULL DEFAULT '0',
  `payout_upsell` tinyint(1) UNSIGNED NOT NULL DEFAULT '0',
  `country` varchar(255) DEFAULT NULL,
  `notes` text,
  `action_options` text,
  `action_type` varchar(50) DEFAULT NULL,
  `offer_type` varchar(10) DEFAULT 'external',
  `url` text,
  `conversion_cap_enabled` int(1) UNSIGNED DEFAULT '0',
  `daily_cap` int(10) UNSIGNED DEFAULT '0',
  `conversion_timezone` varchar(50) DEFAULT 'UTC',
  `alternative_offer_id` int(11) DEFAULT NULL,
  `overcap_reject` int(1) UNSIGNED DEFAULT '0',
  `overcap_s2s_skip` int(1) UNSIGNED DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_offers`
--

INSERT INTO `keitaro_offers` (`id`, `name`, `group_id`, `action_payload`, `affiliate_network_id`, `payout_value`, `payout_currency`, `payout_type`, `state`, `created_at`, `updated_at`, `payout_auto`, `payout_upsell`, `country`, `notes`, `action_options`, `action_type`, `offer_type`, `url`, `conversion_cap_enabled`, `daily_cap`, `conversion_timezone`, `alternative_offer_id`, `overcap_reject`, `overcap_s2s_skip`) VALUES
(1, 'Серый', 0, '', 0, '0.0000', 'RUB', 'CPA', 'deleted', '2020-07-08 16:06:23', '2020-09-20 12:08:54', 1, 1, '[]', '', '{\"folder\":\"seriy\"}', 'local_file', 'local', NULL, 0, 0, 'Europe/Moscow', 0, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_ad_campaign_ids`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 20 2020 г., 18:39
--

DROP TABLE IF EXISTS `keitaro_ref_ad_campaign_ids`;
CREATE TABLE `keitaro_ref_ad_campaign_ids` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_ad_campaign_ids`
--

INSERT INTO `keitaro_ref_ad_campaign_ids` (`id`, `value`) VALUES
(1, ''),
(2, '{{campaign.name}}');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_browsers`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 23 2020 г., 07:18
--

DROP TABLE IF EXISTS `keitaro_ref_browsers`;
CREATE TABLE `keitaro_ref_browsers` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_browsers`
--

INSERT INTO `keitaro_ref_browsers` (`id`, `value`) VALUES
(3, ''),
(13, 'aiohttp'),
(1, 'Chrome'),
(2, 'Chrome Mobile'),
(6, 'Firefox'),
(14, 'Go-http-client'),
(9, 'Headless Chrome'),
(5, 'Instagram App'),
(10, 'Internet Explorer'),
(12, 'Maxthon'),
(4, 'Mobile Safari'),
(11, 'Opera'),
(7, 'Samsung Browser'),
(8, 'Yandex Browser');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_browser_versions`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 25 2020 г., 16:27
--

DROP TABLE IF EXISTS `keitaro_ref_browser_versions`;
CREATE TABLE `keitaro_ref_browser_versions` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` varchar(32) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_browser_versions`
--

INSERT INTO `keitaro_ref_browser_versions` (`id`, `value`) VALUES
(2, ''),
(26, '1.1'),
(7, '11.0'),
(17, '11.11'),
(6, '12.0'),
(15, '13.1.1'),
(3, '13.1.2'),
(19, '142.0.0.34.110'),
(4, '159.0.0.40.122'),
(16, '2.0'),
(10, '20.3.1.197'),
(20, '3.5.4'),
(35, '40.0.2214.85'),
(30, '49.0'),
(28, '50.0'),
(37, '53.0.2907.68'),
(31, '54.0.2862.74'),
(14, '54.0.2952.54'),
(12, '6.0'),
(22, '63.0.3239.132'),
(29, '66.0.3359.181'),
(34, '67.0.3396.87'),
(13, '67.0.3396.99'),
(23, '68.0.3432.3'),
(18, '7.0'),
(36, '70.0'),
(27, '70.0.3538.102'),
(11, '71.0.3542.0'),
(24, '72.0.3626.121'),
(21, '75.0.3770.100'),
(32, '76.0.3809.71'),
(8, '78.0.3904.108'),
(5, '80.0'),
(33, '80.0.3987.149'),
(25, '83.0.4103.97'),
(9, '84.0.4147.105'),
(1, '85.0.4183.102');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_cities`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 25 2020 г., 16:27
--

DROP TABLE IF EXISTS `keitaro_ref_cities`;
CREATE TABLE `keitaro_ref_cities` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_cities`
--

INSERT INTO `keitaro_ref_cities` (`id`, `value`) VALUES
(19, '-'),
(34, 'Amsterdam'),
(2, 'Ashburn'),
(16, 'Athens'),
(15, 'Austin'),
(24, 'Bekasi'),
(18, 'Biysk'),
(35, 'Buffalo'),
(38, 'Clearwater'),
(5, 'Dublin'),
(17, 'Dusseldorf'),
(21, 'Hangzhou'),
(36, 'Kiev'),
(7, 'Kirov'),
(30, 'Kirovohrad'),
(40, 'Kondratovo'),
(25, 'Krasnoyarsk'),
(26, 'Lansing'),
(14, 'Lermontovka'),
(8, 'Mechetinskaya'),
(28, 'Melaka'),
(3, 'Menlo Park'),
(27, 'Middletown'),
(1, 'Minsk'),
(32, 'Montreal'),
(4, 'Moscow'),
(39, 'Munich'),
(12, 'Omsk'),
(20, 'Orsha'),
(23, 'Portland'),
(31, 'Prague'),
(6, 'Saint Petersburg'),
(11, 'Samara'),
(10, 'San Antonio'),
(37, 'Santa Clara'),
(33, 'Stockholm'),
(22, 'Tehran'),
(13, 'Tomsk'),
(29, 'Toronto'),
(9, 'Yaroslavl\''),
(41, 'Zheleznodorozhnyy');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_connection_types`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 20 2020 г., 13:41
--

DROP TABLE IF EXISTS `keitaro_ref_connection_types`;
CREATE TABLE `keitaro_ref_connection_types` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` varchar(15) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_connection_types`
--

INSERT INTO `keitaro_ref_connection_types` (`id`, `value`) VALUES
(1, ''),
(3, 'Cellular'),
(2, 'Wifi');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_countries`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 24 2020 г., 03:51
--

DROP TABLE IF EXISTS `keitaro_ref_countries`;
CREATE TABLE `keitaro_ref_countries` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` varchar(2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_countries`
--

INSERT INTO `keitaro_ref_countries` (`id`, `value`) VALUES
(7, '-'),
(1, 'BY'),
(12, 'CA'),
(8, 'CN'),
(6, 'DE'),
(5, 'GR'),
(10, 'ID'),
(4, 'IE'),
(9, 'IR'),
(11, 'MY'),
(15, 'NL'),
(3, 'RU'),
(14, 'SE'),
(13, 'UA'),
(2, 'US');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_creative_ids`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 20 2020 г., 18:39
--

DROP TABLE IF EXISTS `keitaro_ref_creative_ids`;
CREATE TABLE `keitaro_ref_creative_ids` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_creative_ids`
--

INSERT INTO `keitaro_ref_creative_ids` (`id`, `value`) VALUES
(1, ''),
(2, '{{ad.name}}');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_destinations`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 20 2020 г., 14:59
--

DROP TABLE IF EXISTS `keitaro_ref_destinations`;
CREATE TABLE `keitaro_ref_destinations` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `value` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_destinations`
--

INSERT INTO `keitaro_ref_destinations` (`id`, `value`) VALUES
(1, 'Do nothing'),
(2, 'http://tracking.c4aff77.net/click?pid=1404&offer_id=132&sub2=aff_id'),
(3, 'https://bongacams7.com/track?c=702195');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_device_models`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 21 2020 г., 17:05
--

DROP TABLE IF EXISTS `keitaro_ref_device_models`;
CREATE TABLE `keitaro_ref_device_models` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_device_models`
--

INSERT INTO `keitaro_ref_device_models` (`id`, `value`) VALUES
(1, ''),
(2, 'Google Nexus 5'),
(6, 'Samsung GALAXY Grand Prime Plus'),
(5, 'Samsung SM-A217F'),
(4, 'Xiaomi Redmi 6A'),
(3, 'iPhone');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_device_types`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 20 2020 г., 12:36
--

DROP TABLE IF EXISTS `keitaro_ref_device_types`;
CREATE TABLE `keitaro_ref_device_types` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_device_types`
--

INSERT INTO `keitaro_ref_device_types` (`id`, `value`) VALUES
(3, ''),
(1, 'desktop'),
(2, 'mobile');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_external_ids`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 20 2020 г., 12:30
--

DROP TABLE IF EXISTS `keitaro_ref_external_ids`;
CREATE TABLE `keitaro_ref_external_ids` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` mediumtext CHARACTER SET utf8 COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_external_ids`
--

INSERT INTO `keitaro_ref_external_ids` (`id`, `value`) VALUES
(1, '');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_ips`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 25 2020 г., 16:27
--

DROP TABLE IF EXISTS `keitaro_ref_ips`;
CREATE TABLE `keitaro_ref_ips` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` int(10) UNSIGNED DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_ips`
--

INSERT INTO `keitaro_ref_ips` (`id`, `value`) VALUES
(66, 84414701),
(41, 84468829),
(68, 90545695),
(42, 184483842),
(51, 520975117),
(7, 520975119),
(10, 520975222),
(39, 520978185),
(77, 531452444),
(1, 634675773),
(45, 661130852),
(61, 753539482),
(32, 787548012),
(60, 874877632),
(49, 919239396),
(72, 920460205),
(71, 1100669549),
(13, 1121752436),
(47, 1121752439),
(56, 1139002382),
(2, 1168898821),
(24, 1168898834),
(21, 1168898835),
(20, 1168898844),
(36, 1168898927),
(30, 1176853297),
(43, 1360944314),
(29, 1435238568),
(26, 1467300451),
(48, 1489628517),
(40, 1503916785),
(62, 1539962803),
(70, 1542164185),
(46, 1543233355),
(34, 1545965376),
(67, 1605255986),
(59, 1760924028),
(27, 1841736196),
(58, 1909605789),
(52, 1920770434),
(75, 2331442447),
(11, 2509938963),
(74, 2828526943),
(54, 2871132133),
(69, 2901784037),
(44, 2918995730),
(5, 2918995737),
(6, 2918995740),
(3, 2918995832),
(18, 2919000834),
(16, 2919000838),
(17, 2919000844),
(23, 2919000845),
(25, 2919000851),
(15, 2919000853),
(19, 2919000945),
(22, 2919000949),
(8, 2919005956),
(28, 2919005971),
(9, 2919005978),
(33, 2957059477),
(65, 2957688917),
(12, 2995633110),
(35, 3104603214),
(53, 3107336578),
(50, 3109444919),
(55, 3111492331),
(31, 3117583647),
(4, 3162040089),
(38, 3162209942),
(73, 3223602864),
(14, 3285391318),
(57, 3458838172),
(37, 3494953513),
(64, 3514771410),
(76, 3558997813),
(63, 3563463065);

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_isp`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 20 2020 г., 12:30
--

DROP TABLE IF EXISTS `keitaro_ref_isp`;
CREATE TABLE `keitaro_ref_isp` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_isp`
--

INSERT INTO `keitaro_ref_isp` (`id`, `value`) VALUES
(1, '');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_keywords`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 20 2020 г., 12:30
--

DROP TABLE IF EXISTS `keitaro_ref_keywords`;
CREATE TABLE `keitaro_ref_keywords` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_keywords`
--

INSERT INTO `keitaro_ref_keywords` (`id`, `value`) VALUES
(1, '');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_languages`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 22 2020 г., 01:22
--

DROP TABLE IF EXISTS `keitaro_ref_languages`;
CREATE TABLE `keitaro_ref_languages` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` varchar(15) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_languages`
--

INSERT INTO `keitaro_ref_languages` (`id`, `value`) VALUES
(2, ''),
(3, 'en'),
(4, 'EN'),
(5, 'id'),
(1, 'ru');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_operators`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 25 2020 г., 16:27
--

DROP TABLE IF EXISTS `keitaro_ref_operators`;
CREATE TABLE `keitaro_ref_operators` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_operators`
--

INSERT INTO `keitaro_ref_operators` (`id`, `value`) VALUES
(1, ''),
(4, 'hamrahe_aval_ir'),
(3, 'life_by'),
(6, 'megafon_ru'),
(2, 'mts_ru'),
(5, 'telkomsel_id');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_os`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 23 2020 г., 07:17
--

DROP TABLE IF EXISTS `keitaro_ref_os`;
CREATE TABLE `keitaro_ref_os` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` varchar(32) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_os`
--

INSERT INTO `keitaro_ref_os` (`id`, `value`) VALUES
(3, ''),
(2, 'Android'),
(7, 'GNU/Linux'),
(4, 'iOS'),
(5, 'OS X'),
(6, 'Ubuntu'),
(1, 'Windows');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_os_versions`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 24 2020 г., 17:34
--

DROP TABLE IF EXISTS `keitaro_ref_os_versions`;
CREATE TABLE `keitaro_ref_os_versions` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` varchar(32) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_os_versions`
--

INSERT INTO `keitaro_ref_os_versions` (`id`, `value`) VALUES
(3, ''),
(1, '10'),
(14, '10.12.3'),
(6, '10.13'),
(17, '10.15.2'),
(8, '10.15.3'),
(7, '12.1.2'),
(11, '13.5.1'),
(4, '13.7'),
(15, '14.0'),
(2, '6.0'),
(12, '6.0.1'),
(9, '7'),
(16, '8'),
(13, '8.1'),
(5, '9'),
(10, 'XP');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_params`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_ref_params`;
CREATE TABLE `keitaro_ref_params` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(64) NOT NULL,
  `value` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_referrers`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 25 2020 г., 12:17
--

DROP TABLE IF EXISTS `keitaro_ref_referrers`;
CREATE TABLE `keitaro_ref_referrers` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_referrers`
--

INSERT INTO `keitaro_ref_referrers` (`id`, `value`) VALUES
(1, ''),
(4, 'ALISHOPCOM.RU'),
(6, 'http://alishopcom.ru'),
(5, 'http://alishopcom.ru/'),
(7, 'http://entimshop.com'),
(2, 'http://entimshop.com/'),
(3, 'https://l.instagram.com/'),
(8, 'https://yapl.ru/ru/alishopcom.ru/');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_regions`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 25 2020 г., 16:27
--

DROP TABLE IF EXISTS `keitaro_ref_regions`;
CREATE TABLE `keitaro_ref_regions` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` varchar(64) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_regions`
--

INSERT INTO `keitaro_ref_regions` (`id`, `value`) VALUES
(18, ''),
(1, 'BY_MI'),
(19, 'BY_VI'),
(28, 'CA_ON'),
(31, 'CA_QC'),
(20, 'CN_33'),
(37, 'DE_BY'),
(16, 'DE_NW'),
(15, 'GR_0I'),
(23, 'ID_JB'),
(5, 'IE_0D'),
(21, 'IR_07'),
(27, 'MY_04'),
(33, 'NL_NH'),
(17, 'RU_ALT'),
(14, 'RU_KHA'),
(7, 'RU_KIR'),
(24, 'RU_KYA'),
(39, 'RU_MOS'),
(4, 'RU_MOW'),
(12, 'RU_OMS'),
(38, 'RU_PER'),
(8, 'RU_ROS'),
(11, 'RU_SAM'),
(6, 'RU_SPE'),
(13, 'RU_TOM'),
(9, 'RU_YAR'),
(32, 'SE_AB'),
(35, 'UA_30'),
(29, 'UA_35'),
(3, 'US_CA'),
(26, 'US_DE'),
(36, 'US_FL'),
(25, 'US_MI'),
(34, 'US_NY'),
(30, 'US_OK'),
(22, 'US_OR'),
(10, 'US_TX'),
(2, 'US_VA');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_search_engines`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 25 2020 г., 12:17
--

DROP TABLE IF EXISTS `keitaro_ref_search_engines`;
CREATE TABLE `keitaro_ref_search_engines` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_search_engines`
--

INSERT INTO `keitaro_ref_search_engines` (`id`, `value`) VALUES
(1, ''),
(4, 'alishopcom.ru'),
(2, 'entimshop.com'),
(3, 'l.instagram.com'),
(5, 'yapl.ru');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_sources`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 25 2020 г., 12:17
--

DROP TABLE IF EXISTS `keitaro_ref_sources`;
CREATE TABLE `keitaro_ref_sources` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_sources`
--

INSERT INTO `keitaro_ref_sources` (`id`, `value`) VALUES
(1, ''),
(5, 'alishopcom.ru'),
(2, 'entimshop.com'),
(3, 'l.instagram.com'),
(6, 'utmstat'),
(7, 'yapl.ru'),
(4, '{{site_source_name}}');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_sub_ids`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 20 2020 г., 18:39
--

DROP TABLE IF EXISTS `keitaro_ref_sub_ids`;
CREATE TABLE `keitaro_ref_sub_ids` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_sub_ids`
--

INSERT INTO `keitaro_ref_sub_ids` (`id`, `value`) VALUES
(1, ''),
(5, '{{ad.id}}'),
(4, '{{adset.id}}'),
(6, '{{adset.name}}'),
(3, '{{campaign.id}}'),
(2, '{{placement}}');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_user_agents`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 25 2020 г., 16:27
--

DROP TABLE IF EXISTS `keitaro_ref_user_agents`;
CREATE TABLE `keitaro_ref_user_agents` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_user_agents`
--

INSERT INTO `keitaro_ref_user_agents` (`id`, `value`) VALUES
(21, 'Dy robot 1.0'),
(37, 'Go-http-client/1.1'),
(6, 'KHttpClient'),
(19, 'Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1; .NET CLR 1.1.4322; .NET CLR 2.0.50728)'),
(26, 'Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.1; The World)'),
(29, 'Mozilla/5.0 (Linux; Android 10; RMX2185 Build/QP1A.190711.020; wv) AppleWebKit/537.36 (KHTML, like Gecko) Version/4.0 Chrome/80.0.3987.99 Mobile Safari/537.36 Instagram 142.0.0.34.110 Android (29/10; 272dpi; 720x1469; realme; RMX2185; RMX2185; mt6765; in_'),
(13, 'Mozilla/5.0 (Linux; Android 10; SAMSUNG SM-A217F) AppleWebKit/537.36 (KHTML, like Gecko) SamsungBrowser/11.0 Chrome/75.0.3770.143 Mobile Safari/537.36'),
(7, 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/85.0.4183.110 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)'),
(27, 'Mozilla/5.0 (Linux; Android 6.0.1; SM-G532F Build/MMB29T; wv) AppleWebKit/537.36 (KHTML, like Gecko) Version/4.0 Chrome/56.0.2924.87 Mobile Safari/537.36 Instagram 159.0.0.40.122 Android (23/6.0.1; 240dpi; 540x960; samsung; SM-G532F; grandpplte; mt6735; e'),
(2, 'Mozilla/5.0 (Linux; Android 6.0; Nexus 5 Build/MRA58N) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/85.0.4183.102 Mobile Safari/537.36'),
(5, 'Mozilla/5.0 (Linux; Android 9; Redmi 6A Build/PPR1.180610.011; wv) AppleWebKit/537.36 (KHTML, like Gecko) Version/4.0 Chrome/85.0.4183.101 Mobile Safari/537.36 Instagram 159.0.0.40.122 Android (28/9; 320dpi; 720x1380; Xiaomi/xiaomi; Redmi 6A; cactus; mt67'),
(48, 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.13; rv:70.0) Gecko/20100101 Firefox/70.0'),
(9, 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.13; rv:80.0) Gecko/20100101 Firefox/80.0'),
(33, 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_12_3) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/68.0.3432.3 Safari/537.36'),
(45, 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_2) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/80.0.3987.149 Safari/537.36'),
(15, 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_3) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/84.0.4147.105 Safari/537.36'),
(20, 'Mozilla/5.0 (Windows NT 10.0) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/67.0.3396.99 Safari/537.36'),
(32, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/63.0.3239.132 Safari/537.36'),
(49, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/66.0.3359.170 Safari/537.36 OPR/53.0.2907.68'),
(35, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/72.0.3626.121 Safari/537.36'),
(44, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/76.0.3809.71 Safari/537.36'),
(14, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.108 Safari/537.36'),
(1, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/85.0.4183.102 Safari/537.36'),
(17, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) HeadlessChrome/71.0.3542.0 Safari/537.36'),
(39, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:50.0) Gecko/20100101 Firefox/50.0'),
(41, 'Mozilla/5.0 (Windows NT 6.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/66.0.3359.181 Safari/537.36'),
(16, 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/80.0.3987.132 YaBrowser/20.3.1.197 Yowser/2.5 Safari/537.36'),
(47, 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/40.0.2214.85 Safari/537.36'),
(22, 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/67.0.3396.87 Safari/537.36 OPR/54.0.2952.54'),
(38, 'Mozilla/5.0 (Windows NT 6.2; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.102 Safari/537.36'),
(46, 'Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/67.0.3396.87 Safari/537.36'),
(42, 'Mozilla/5.0 (Windows NT 6.3; WOW64; rv:49.0) Gecko/20100101 Firefox/49.0'),
(31, 'Mozilla/5.0 (Windows NT 6.3; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/75.0.3770.100 Safari/537.36'),
(36, 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/83.0.4103.97 Safari/537.36'),
(43, 'Mozilla/5.0 (X11; Ubuntu; Linux i686 on x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/54.0.2862.74 Safari/537.36'),
(11, 'Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:80.0) Gecko/20100101 Firefox/80.0'),
(18, 'Mozilla/5.0 (compatible; BackupLand/1.0; https://go.backupland.com/; Domain check for viruses;)'),
(28, 'Mozilla/5.0 (compatible; WebDataStats/1.0 ; +https://webdatastats.com/policy.html)'),
(10, 'Mozilla/5.0 (compatible; vkShare; +http://vk.com/dev/Share)'),
(12, 'Mozilla/5.0 (iPhone; CPU iPhone OS 12_1_2 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/12.0 Mobile/15E148 Safari/604.1'),
(23, 'Mozilla/5.0 (iPhone; CPU iPhone OS 13_5_1 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.1.1 Mobile/15E148 Safari/604.1'),
(4, 'Mozilla/5.0 (iPhone; CPU iPhone OS 13_7 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.1.2 Mobile/15E148 Safari/604.1'),
(34, 'Mozilla/5.0 (iPhone; CPU iPhone OS 14_0 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Mobile/15E148'),
(25, 'Opera/9.80 (Windows NT 6.1; U; en) Presto/2.8.131 Version/11.11'),
(30, 'Python/3.8 aiohttp/3.5.4'),
(40, 'Scrapy/1.7.2 (+https://scrapy.org)'),
(8, 'TelegramBot (like TwitterBot)'),
(24, 'User-Agent, Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.1; Maxthon 2.0)'),
(3, 'facebookexternalhit/1.1 (+http://www.facebook.com/externalhit_uatext.php)');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_ref_x_requested_with`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 20 2020 г., 12:30
--

DROP TABLE IF EXISTS `keitaro_ref_x_requested_with`;
CREATE TABLE `keitaro_ref_x_requested_with` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_ref_x_requested_with`
--

INSERT INTO `keitaro_ref_x_requested_with` (`id`, `value`) VALUES
(1, '');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_report_bookmarks`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_report_bookmarks`;
CREATE TABLE `keitaro_report_bookmarks` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(50) NOT NULL,
  `user_id` int(10) UNSIGNED NOT NULL,
  `is_shared` tinyint(1) UNSIGNED DEFAULT '0',
  `payload` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_requests`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_requests`;
CREATE TABLE `keitaro_requests` (
  `id` int(11) NOT NULL,
  `stream_id` int(10) UNSIGNED NOT NULL,
  `datetime` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_sales`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_sales`;
CREATE TABLE `keitaro_sales` (
  `id` int(10) UNSIGNED NOT NULL,
  `campaign_id` int(11) DEFAULT NULL,
  `group_id` int(11) DEFAULT NULL,
  `stream_id` int(10) UNSIGNED DEFAULT NULL,
  `sub_id` varchar(25) NOT NULL,
  `profit` decimal(10,2) DEFAULT NULL,
  `params` text,
  `datetime` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_sessions`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_sessions`;
CREATE TABLE `keitaro_sessions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `visitor_code` varchar(50) NOT NULL,
  `expires_at` datetime NOT NULL,
  `payload` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_settings`
--
-- Создание: Сен 19 2020 г., 15:01
-- Последнее обновление: Сен 20 2020 г., 12:06
--

DROP TABLE IF EXISTS `keitaro_settings`;
CREATE TABLE `keitaro_settings` (
  `key` varchar(100) NOT NULL,
  `value` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_settings`
--

INSERT INTO `keitaro_settings` (`key`, `value`) VALUES
('api_key', 'd136f161773de977663f6e2d2bcbe992'),
('archive_ttl', '60'),
('avoid_mysql', '1'),
('av_service', 'avscan'),
('cache_storage', 'files'),
('check_bot_empty_ua', '1'),
('check_bot_ip', '1'),
('check_bot_prefetch', '0'),
('check_bot_referer', '0'),
('check_bot_ua', '1'),
('clicks_affiliate_network_id_exists', '1'),
('clicks_sub_id_15_id_exists', '1'),
('clicks_x_requested_with_id_exists', '1'),
('conversions_2_affiliate_network_id_exists', '1'),
('conversions_2_previous_conversion_id_exists', '1'),
('conversions_2_sub_id_15_id_exists', '1'),
('conversions_2_x_requested_with_id_exists', '1'),
('currency', 'RUB'),
('default_action_allowed', '1'),
('detect_spam_bots', '1'),
('diagnostic_last_file_check', '1600602546'),
('disable_stats', '0'),
('draft_data_storage', 'file'),
('extra_action', 'redirect'),
('extra_url', 'https://google.com'),
('force_token_files', '0'),
('geodb', 'ip2location_lite'),
('id_aliases', 'id, g, group, sid'),
('ingore_prefetch', '1'),
('installed_at', '2020-07-08 15:56:46'),
('ipdb', '{\"0\":null,\"1\":null,\"2\":null,\"3\":null,\"4\":null,\"5\":null,\"6\":null,\"7\":null,\"8\":null,\"country\":\"ip2location_lite\",\"region\":\"ip2location_lite\",\"city\":\"ip2location_lite\",\"city_ru\":\"sypex_lite\",\"connection_type\":\"keitaro_carrier\",\"operator\":\"keitaro_carrier\",\"bot_type\":\"keitaro_bot_db2\",\"isp\":null,\"proxy_type\":null}'),
('is_beta_channel', ''),
('is_sidebar_enabled', '1'),
('keyword_aliases', 'keyword, utm_term, utm_kwd'),
('links_style', 'new'),
('lp_allow_php', '1'),
('lp_dir', 'lander'),
('lp_offer_token_ttl', '1440'),
('memcached_server', 'localhost:11211'),
('operators_service', 'carrierdb'),
('redis_server', '127.0.0.1:6379/1'),
('referrer_aliases', 'referrer, referer'),
('s2s_timeout', '5'),
('se_aliases', ''),
('se_referrer_aliases', 'se_referer, se_referrer, seoref'),
('show_extra_param', '0'),
('source_aliases', 'source, utm_source'),
('stats_ttl', '256'),
('sub_id_1_aliases', ''),
('sub_id_2_aliases', ''),
('sub_id_3_aliases', ''),
('sub_id_4_aliases', '');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_shards`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_shards`;
CREATE TABLE `keitaro_shards` (
  `id` int(11) NOT NULL,
  `date` varchar(8) NOT NULL,
  `version` varchar(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_streams`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 22 2020 г., 16:56
--

DROP TABLE IF EXISTS `keitaro_streams`;
CREATE TABLE `keitaro_streams` (
  `id` int(11) NOT NULL,
  `type` varchar(50) NOT NULL DEFAULT 'regular',
  `name` varchar(100) DEFAULT NULL,
  `campaign_id` int(10) UNSIGNED DEFAULT NULL,
  `group_id` int(11) DEFAULT NULL,
  `position` int(11) NOT NULL DEFAULT '1',
  `chance` int(3) NOT NULL DEFAULT '0',
  `redirect_type` varchar(50) DEFAULT NULL,
  `url` text,
  `action_options` text,
  `comments` text,
  `state` varchar(50) NOT NULL DEFAULT 'active',
  `updated_at` datetime DEFAULT NULL,
  `action_type` varchar(50) DEFAULT NULL,
  `action_payload` mediumtext,
  `schema` varchar(30) DEFAULT NULL,
  `collect_clicks` int(1) UNSIGNED DEFAULT '1',
  `filter_or` int(1) UNSIGNED DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_streams`
--

INSERT INTO `keitaro_streams` (`id`, `type`, `name`, `campaign_id`, `group_id`, `position`, `chance`, `redirect_type`, `url`, `action_options`, `comments`, `state`, `updated_at`, `action_type`, `action_payload`, `schema`, `collect_clicks`, `filter_or`) VALUES
(1, 'forced', 'Боты', 1, NULL, 1, 0, NULL, NULL, 'null', '', 'active', '2020-09-22 16:56:36', 'do_nothing', '', 'action', 1, 0),
(2, 'regular', 'Пользователь', 1, NULL, 1, 0, NULL, NULL, 'null', '', 'active', '2020-09-22 16:56:36', 'http', 'https://bongacams7.com/track?c=702195', 'redirect', 1, 0),
(3, 'default', 'Stream 3', 1, NULL, 3, 0, NULL, NULL, 'null', '', 'active', '2020-09-22 16:56:36', 'do_nothing', '', 'action', 1, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_stream_filters`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 22 2020 г., 16:56
--

DROP TABLE IF EXISTS `keitaro_stream_filters`;
CREATE TABLE `keitaro_stream_filters` (
  `id` int(10) UNSIGNED NOT NULL,
  `stream_id` int(10) UNSIGNED NOT NULL,
  `name` varchar(100) NOT NULL,
  `mode` varchar(40) NOT NULL,
  `payload` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_stream_filters`
--

INSERT INTO `keitaro_stream_filters` (`id`, `stream_id`, `name`, `mode`, `payload`) VALUES
(1, 1, 'bot', 'accept', 'null'),
(2, 1, 'proxy', 'accept', 'null'),
(3, 1, 'country', 'accept', '[\"US\",\"IE\"]'),
(4, 1, 'user_agent', 'accept', '[\"facebookexternalhit\\/1.1 ( http:\\/\\/www.facebook.com\\/externalhit_uatext.php)\",\"facebook\",\"facebot\",\"facebookexternalhit\\/1.0\",\"proximic\",\"facebookexternalhit\\/1.1\",\"Python-urllib\",\"python-requests\",\"zgrab\\/0.x\",\"Wget(linux)\"]'),
(5, 1, 'ipv_6', 'accept', 'null'),
(6, 2, 'device_type', 'accept', '[\"mobile\",\"tablet\",\"desktop\"]'),
(8, 2, 'country', 'reject', '[\"US\",\"IE\"]');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_stream_groups`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_stream_groups`;
CREATE TABLE `keitaro_stream_groups` (
  `id` int(11) NOT NULL,
  `key` varchar(50) DEFAULT NULL,
  `name` varchar(200) DEFAULT NULL,
  `type` varchar(20) NOT NULL DEFAULT 'position',
  `uniq_time` int(11) NOT NULL DEFAULT '24',
  `uniq_check_type` varchar(50) NOT NULL DEFAULT 'ip',
  `status` tinyint(1) NOT NULL DEFAULT '1',
  `exit_stream` text,
  `exit_stream_type` varchar(20) NOT NULL DEFAULT 'location',
  `action_for_bots` varchar(50) NOT NULL DEFAULT '404',
  `bot_redirect_url` text,
  `bot_text` text,
  `conversion_tracking_enabled` tinyint(1) NOT NULL DEFAULT '0',
  `disable_tracking_exit` tinyint(1) UNSIGNED NOT NULL DEFAULT '0',
  `advertising_mode` int(1) UNSIGNED NOT NULL DEFAULT '0',
  `position` int(10) UNSIGNED DEFAULT NULL,
  `state` varchar(50) NOT NULL DEFAULT 'active'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_stream_landing_associations`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_stream_landing_associations`;
CREATE TABLE `keitaro_stream_landing_associations` (
  `id` int(20) UNSIGNED NOT NULL,
  `stream_id` int(20) UNSIGNED NOT NULL,
  `landing_id` int(20) UNSIGNED NOT NULL,
  `state` varchar(10) NOT NULL,
  `share` int(10) NOT NULL,
  `created_at` datetime NOT NULL,
  `updated_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_stream_offer_associations`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 20 2020 г., 12:08
--

DROP TABLE IF EXISTS `keitaro_stream_offer_associations`;
CREATE TABLE `keitaro_stream_offer_associations` (
  `id` int(20) UNSIGNED NOT NULL,
  `stream_id` int(20) UNSIGNED NOT NULL,
  `offer_id` int(20) UNSIGNED NOT NULL,
  `state` varchar(10) NOT NULL,
  `share` int(10) NOT NULL,
  `created_at` datetime NOT NULL,
  `updated_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_third_party_integration`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_third_party_integration`;
CREATE TABLE `keitaro_third_party_integration` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `integration` varchar(255) NOT NULL,
  `settings` text,
  `created_at` datetime NOT NULL,
  `updated_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_third_party_integration_campaign_associations`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 22 2020 г., 16:56
--

DROP TABLE IF EXISTS `keitaro_third_party_integration_campaign_associations`;
CREATE TABLE `keitaro_third_party_integration_campaign_associations` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `integration_id` int(20) UNSIGNED NOT NULL,
  `campaign_id` int(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_third_party_integration_campaign_associations`
--

INSERT INTO `keitaro_third_party_integration_campaign_associations` (`id`, `integration_id`, `campaign_id`) VALUES
(7, 0, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_traffic_sources`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_traffic_sources`;
CREATE TABLE `keitaro_traffic_sources` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `postback_url` text,
  `postback_statuses` varchar(255) DEFAULT '["sale","lead","rejected","rebill"]',
  `template_name` varchar(255) DEFAULT NULL,
  `accept_parameters` tinyint(1) UNSIGNED DEFAULT '1',
  `parameters` text,
  `state` varchar(255) DEFAULT NULL,
  `created_at` datetime NOT NULL,
  `updated_at` datetime NOT NULL,
  `notes` text,
  `traffic_loss` decimal(4,2) DEFAULT '0.00'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_traffic_sources`
--

INSERT INTO `keitaro_traffic_sources` (`id`, `name`, `postback_url`, `postback_statuses`, `template_name`, `accept_parameters`, `parameters`, `state`, `created_at`, `updated_at`, `notes`, `traffic_loss`) VALUES
(1, 'Facebook.com', '', '[\"lead\",\"sale\",\"rejected\"]', 'facebook', 1, '{\"source\":{\"name\":\"utm_source\",\"placeholder\":\"{{site_source_name}}\"},\"sub_id_1\":{\"name\":\"utm_placement\",\"placeholder\":\"{{placement}}\"},\"sub_id_2\":{\"name\":\"campaign_id\",\"placeholder\":\"{{campaign.id}}\"},\"sub_id_3\":{\"name\":\"adset_id\",\"placeholder\":\"{{adset.id}}\"},\"sub_id_4\":{\"name\":\"ad_id\",\"placeholder\":\"{{ad.id}}\"},\"sub_id_5\":{\"name\":\"adset_name\",\"placeholder\":\"{{adset.name}}\"},\"creative_id\":{\"name\":\"utm_creative\",\"placeholder\":\"{{ad.name}}\"},\"ad_campaign_id\":{\"name\":\"utm_campaign\",\"placeholder\":\"{{campaign.name}}\"}}', 'active', '2020-07-08 16:00:24', '2020-07-08 16:00:24', NULL, '0.00');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_triggers`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_triggers`;
CREATE TABLE `keitaro_triggers` (
  `id` int(10) UNSIGNED NOT NULL,
  `stream_id` int(10) UNSIGNED NOT NULL,
  `target` varchar(50) NOT NULL,
  `condition` varchar(100) NOT NULL,
  `selected_page` varchar(255) DEFAULT NULL,
  `pattern` varchar(255) DEFAULT NULL,
  `action` varchar(100) NOT NULL,
  `interval` int(10) UNSIGNED NOT NULL,
  `next_run_at` int(10) UNSIGNED DEFAULT NULL,
  `alternative_urls` text,
  `grab_from_page` varchar(250) DEFAULT NULL,
  `av_settings` text,
  `reverse` tinyint(1) UNSIGNED NOT NULL DEFAULT '0',
  `enabled` tinyint(1) UNSIGNED NOT NULL DEFAULT '0',
  `scan_page` tinyint(1) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_users`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 25 2020 г., 19:48
--

DROP TABLE IF EXISTS `keitaro_users`;
CREATE TABLE `keitaro_users` (
  `id` int(11) NOT NULL,
  `type` enum('ADMIN','USER') NOT NULL DEFAULT 'USER',
  `login` varchar(50) NOT NULL,
  `password` varchar(32) NOT NULL,
  `password_hash` varchar(255) DEFAULT NULL,
  `rules` text,
  `permissions` varchar(250) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_users`
--

INSERT INTO `keitaro_users` (`id`, `type`, `login`, `password`, `password_hash`, `rules`, `permissions`) VALUES
(1, 'ADMIN', 'admin', 'c4482ab00e51f16f433d3b366e14ef19', '$2y$10$Ycn3hsJ5m3hZwxVTnoPWi.ZtdlFiqR1EOZxN.bkjILXI8LNoJJOGG', 'null', 'null');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_user_bot_ips`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_user_bot_ips`;
CREATE TABLE `keitaro_user_bot_ips` (
  `id` int(20) UNSIGNED NOT NULL,
  `min_ip` int(10) UNSIGNED NOT NULL,
  `max_ip` int(10) UNSIGNED NOT NULL,
  `raw_value` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_user_campaign_permissions`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `keitaro_user_campaign_permissions`;
CREATE TABLE `keitaro_user_campaign_permissions` (
  `id` int(11) UNSIGNED NOT NULL,
  `user_id` int(11) NOT NULL,
  `campaign_id` int(11) NOT NULL,
  `features` text,
  `metrics` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_user_password_hashes`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 25 2020 г., 19:48
--

DROP TABLE IF EXISTS `keitaro_user_password_hashes`;
CREATE TABLE `keitaro_user_password_hashes` (
  `id` int(10) UNSIGNED NOT NULL,
  `user_id` int(10) UNSIGNED NOT NULL,
  `password_hash` varchar(255) DEFAULT NULL,
  `expires_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_user_password_hashes`
--

INSERT INTO `keitaro_user_password_hashes` (`id`, `user_id`, `password_hash`, `expires_at`) VALUES
(4, 1, '$2y$10$QRR5qaykZ3zIJ6izyboD8u69l5K.87yjGw3j98hhrQ0tYp7y0LGiq', '2020-10-21 11:48:32'),
(5, 1, '$2y$10$7dqoupGCTOzCx0GwzVoi9.lgu0bLNISX8dTMH9lqKf6xns8CzV6jG', '2020-10-21 18:14:36'),
(6, 1, '$2y$10$Ycn3hsJ5m3hZwxVTnoPWi.ZtdlFiqR1EOZxN.bkjILXI8LNoJJOGG', '2020-10-26 19:48:31');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_user_preferences`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 24 2020 г., 08:01
--

DROP TABLE IF EXISTS `keitaro_user_preferences`;
CREATE TABLE `keitaro_user_preferences` (
  `id` int(10) UNSIGNED NOT NULL,
  `user_id` int(10) UNSIGNED NOT NULL,
  `pref_name` varchar(50) NOT NULL,
  `pref_value` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_user_preferences`
--

INSERT INTO `keitaro_user_preferences` (`id`, `user_id`, `pref_name`, `pref_value`) VALUES
(1, 1, 'timezone', 'Europe/Moscow'),
(2, 1, 'language', 'ru'),
(3, 1, 'dashboard_preferences', '{\"enabledMetrics\":[\"clicks\",\"campaign_unique_clicks\",\"conversions\",\"cost\",\"sale_revenue\",\"profit_confirmed\",\"roi_confirmed\"],\"enabledEntities\":[\"campaign\",\"landing\",\"offer\",\"ts\",\"country\"],\"lastClicksColumns\":[\"datetime\",\"campaign\",\"os_icon\",\"browser_icon\",\"ip\",\"destination\",\"country_flag\"],\"topMetrics\":[\"clicks\",\"campaign_unique_clicks\",\"conversions\"]}'),
(4, 1, 'dashboard.index-recent_clicks', '{\"limit\":10,\"sort\":[\"campaign\",\"desc\"],\"filters\":[],\"user_columns\":[\"datetime\",\"campaign\",\"os_icon\",\"browser_icon\",\"ip\",\"destination\",\"country_flag\"],\"resized_columns\":{\"destination\":313},\"fixed_columns\":[\"datetime\",\"campaign\",\"os_icon\",\"browser_icon\",\"ip\",\"destination\",\"country_flag\"]}'),
(5, 1, 'dashboard.index-campaign', '{\"grouping\":[\"campaign\"],\"metrics\":[\"clicks\",\"campaign_unique_clicks\",\"conversions\"],\"limit\":5,\"sort\":[\"clicks\",\"desc\"],\"filters\":[{\"name\":\"campaign\",\"operator\":\"is_set\"},{\"name\":\"parent_campaign_id\",\"operator\":\"equals\",\"expression\":\"0\"}]}'),
(6, 1, 'dashboard.index-landing', '{\"grouping\":[\"landing\"],\"metrics\":[\"clicks\",\"campaign_unique_clicks\",\"conversions\"],\"limit\":5,\"sort\":[\"clicks\",\"desc\"],\"filters\":[{\"name\":\"landing\",\"operator\":\"is_set\"},{\"name\":\"parent_campaign_id\",\"operator\":\"equals\",\"expression\":\"0\"}]}'),
(7, 1, 'dashboard.index-ts', '{\"grouping\":[\"ts\"],\"metrics\":[\"clicks\",\"campaign_unique_clicks\",\"conversions\"],\"limit\":5,\"sort\":[\"clicks\",\"desc\"],\"filters\":[{\"name\":\"ts\",\"operator\":\"is_set\"},{\"name\":\"parent_campaign_id\",\"operator\":\"equals\",\"expression\":\"0\"}]}'),
(8, 1, 'dashboard.index-offer', '{\"grouping\":[\"offer\"],\"metrics\":[\"clicks\",\"campaign_unique_clicks\",\"conversions\"],\"limit\":5,\"sort\":[\"clicks\",\"desc\"],\"filters\":[{\"name\":\"offer\",\"operator\":\"is_set\"},{\"name\":\"parent_campaign_id\",\"operator\":\"equals\",\"expression\":\"0\"}]}'),
(9, 1, 'clicks.log', '{\"limit\":50,\"user_columns\":[\"sub_id\",\"datetime\",\"ip\",\"campaign_id\",\"stream_id\",\"landing\",\"offer\",\"ts\",\"affiliate_network\",\"country_flag\",\"region\",\"city\",\"os_icon\",\"browser_icon\",\"connection_type\",\"device_type\",\"device_model\",\"is_bot\",\"is_unique_campaign\"],\"sort\":[\"datetime\",\"desc\"],\"resized_columns\":{\"connection_type\":134}}'),
(10, 1, 'trends.index', '{\"grouping\":[\"day\"],\"metrics\":[\"profitability\",\"clicks\",\"global_unique_clicks\",\"conversions\",\"revenue\",\"cost\",\"profit\",\"cr\",\"epc\",\"roi\"],\"resized_columns\":{\"roi\":68}}');

-- --------------------------------------------------------

--
-- Структура таблицы `keitaro_visitors`
--
-- Создание: Сен 19 2020 г., 15:02
-- Последнее обновление: Сен 25 2020 г., 16:27
--

DROP TABLE IF EXISTS `keitaro_visitors`;
CREATE TABLE `keitaro_visitors` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `visitor_code` varchar(100) NOT NULL,
  `ip_id` int(10) UNSIGNED NOT NULL,
  `user_agent_id` int(10) UNSIGNED NOT NULL,
  `country_id` int(10) UNSIGNED DEFAULT NULL,
  `region_id` int(10) UNSIGNED DEFAULT NULL,
  `city_id` int(10) UNSIGNED DEFAULT NULL,
  `device_type_id` int(10) UNSIGNED DEFAULT NULL,
  `device_model_id` int(10) UNSIGNED DEFAULT NULL,
  `screen_id` int(10) UNSIGNED DEFAULT NULL,
  `language_id` int(10) UNSIGNED DEFAULT NULL,
  `browser_id` int(10) UNSIGNED DEFAULT NULL,
  `browser_version_id` int(10) UNSIGNED DEFAULT NULL,
  `os_id` int(10) UNSIGNED DEFAULT NULL,
  `os_version_id` int(10) UNSIGNED DEFAULT NULL,
  `connection_type_id` int(10) UNSIGNED DEFAULT NULL,
  `operator_id` int(10) UNSIGNED DEFAULT NULL,
  `isp_id` int(10) UNSIGNED DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `keitaro_visitors`
--

INSERT INTO `keitaro_visitors` (`id`, `visitor_code`, `ip_id`, `user_agent_id`, `country_id`, `region_id`, `city_id`, `device_type_id`, `device_model_id`, `screen_id`, `language_id`, `browser_id`, `browser_version_id`, `os_id`, `os_version_id`, `connection_type_id`, `operator_id`, `isp_id`) VALUES
(1, '1pucf8f', 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1),
(2, '3f4hd5', 1, 2, 1, 1, 1, 2, 2, NULL, 1, 2, 1, 2, 2, 2, 1, 1),
(3, '2cmmu5d', 2, 3, 2, 2, 2, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(4, '2l7461q', 3, 4, 2, 3, 3, 2, 3, NULL, 3, 4, 3, 4, 4, 2, 1, 1),
(5, '2gh4v7u', 1, 5, 1, 1, 1, 2, 4, NULL, 1, 5, 4, 2, 5, 2, 1, 1),
(6, '2aejrht', 4, 6, 3, 4, 4, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(7, '37ja4ra', 5, 3, 2, 3, 3, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(8, '1jnslb7', 6, 3, 2, 3, 3, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(9, '3cj85el', 7, 7, 4, 5, 5, 3, 1, NULL, 3, 3, 2, 3, 3, 1, 1, 1),
(10, '3q6n8dc', 8, 3, 2, 2, 2, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(11, 'lvdnmq', 9, 3, 2, 2, 2, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(12, '3d6rkla', 10, 4, 4, 5, 5, 2, 3, NULL, 3, 4, 3, 4, 4, 2, 1, 1),
(13, '3jjm559', 11, 8, 3, 6, 6, 3, 1, NULL, 3, 3, 2, 3, 3, 1, 1, 1),
(14, 'er4aj7', 12, 9, 3, 7, 7, 1, 1, NULL, 1, 6, 5, 5, 6, 3, 2, 1),
(15, '2044fvv', 13, 3, 2, 3, 3, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(16, '30d48mj', 14, 10, 3, 4, 4, 3, 1, NULL, 1, 3, 2, 3, 3, 1, 1, 1),
(17, '2knbc9r', 15, 3, 2, 2, 2, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(18, '3l7p5ut', 16, 3, 2, 2, 2, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(19, '3irdo5r', 17, 3, 2, 2, 2, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(20, '3jr5ulc', 18, 3, 2, 2, 2, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(21, '3v1brrt', 19, 3, 2, 2, 2, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(22, '3mg4o87', 20, 3, 2, 2, 2, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(23, '16p5sb3', 21, 3, 2, 2, 2, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(24, '2f898kr', 22, 3, 2, 2, 2, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(25, '3pb50ti', 23, 3, 2, 2, 2, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(26, '368tpjh', 24, 3, 2, 2, 2, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(27, '32ff1cj', 25, 3, 2, 2, 2, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(28, 't8j604', 26, 11, 3, 8, 8, 1, 1, NULL, 3, 6, 5, 6, 3, 1, 1, 1),
(29, '2j5q99g', 27, 12, 3, 9, 9, 2, 3, NULL, 4, 4, 6, 4, 7, 3, 2, 1),
(30, 'uusqof', 28, 3, 2, 2, 2, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(31, '3r4ravt', 29, 13, 3, 4, 4, 2, 5, NULL, 1, 7, 7, 2, 1, 3, 2, 1),
(32, '3i9fmli', 30, 14, 2, 10, 10, 1, 1, NULL, 3, 1, 8, 1, 1, 1, 1, 1),
(33, '36l0c2f', 31, 15, 3, 11, 11, 1, 1, NULL, 2, 1, 9, 5, 8, 1, 1, 1),
(34, 'neo6a0', 32, 16, 3, 12, 12, 1, 1, NULL, 4, 8, 10, 1, 9, 1, 1, 1),
(35, '3km2b92', 33, 12, 3, 13, 13, 2, 3, NULL, 4, 4, 6, 4, 7, 2, 1, 1),
(36, '2hq95op', 34, 17, 3, 14, 14, 1, 1, NULL, 2, 9, 11, 1, 1, 1, 1, 1),
(37, '2b2q774', 35, 18, 3, 4, 4, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(38, '37qa8gu', 36, 3, 2, 2, 2, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(39, '26f22fj', 37, 19, 2, 10, 15, 1, 1, NULL, 2, 10, 12, 1, 10, 1, 1, 1),
(40, '2n4skcd', 38, 20, 5, 15, 16, 1, 1, NULL, 2, 1, 13, 1, 1, 1, 1, 1),
(41, 'dqib1k', 39, 3, 4, 5, 5, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(42, 'un045v', 40, 21, 6, 16, 17, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(43, '4787lo', 41, 12, 3, 17, 18, 2, 3, NULL, 4, 4, 6, 4, 7, 3, 2, 1),
(44, '1esgm7o', 42, 22, 7, 18, 19, 1, 1, NULL, 2, 11, 14, 1, 9, 1, 1, 1),
(45, '13shg39', 43, 5, 1, 19, 20, 2, 4, NULL, 1, 5, 4, 2, 5, 3, 3, 1),
(46, '139pdml', 44, 23, 2, 3, 3, 2, 3, NULL, 3, 4, 15, 4, 11, 2, 1, 1),
(47, '11gtvs6', 45, 24, 8, 20, 21, 1, 1, NULL, 2, 12, 16, 1, 10, 1, 1, 1),
(48, '10sic7i', 45, 25, 8, 20, 21, 1, 1, NULL, 2, 11, 17, 1, 9, 1, 1, 1),
(49, '26ieuog', 45, 26, 8, 20, 21, 1, 1, NULL, 2, 10, 18, 1, 10, 1, 1, 1),
(50, '1ir3957', 46, 27, 9, 21, 22, 2, 6, NULL, 3, 5, 4, 2, 12, 3, 4, 1),
(51, '1855c3o', 47, 4, 2, 3, 3, 2, 3, NULL, 3, 4, 3, 4, 4, 2, 1, 1),
(52, '17q9shf', 48, 12, 3, 6, 6, 2, 3, NULL, 4, 4, 6, 4, 7, 2, 1, 1),
(53, '2celenr', 49, 6, 2, 22, 23, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(54, '2sbc1r8', 50, 28, 3, 4, 4, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(55, 'uk7teb', 51, 4, 4, 5, 5, 2, 3, NULL, 3, 4, 3, 4, 4, 2, 1, 1),
(56, '23kjegg', 52, 29, 10, 23, 24, 2, 1, NULL, 5, 5, 19, 2, 1, 3, 5, 1),
(57, '1viv7ba', 53, 30, 3, 4, 4, 3, 1, NULL, 2, 13, 20, 3, 3, 1, 1, 1),
(58, '3p3dblr', 54, 6, 3, 24, 25, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(59, '128s78i', 55, 31, 3, 4, 4, 1, 1, NULL, 1, 1, 21, 1, 13, 1, 1, 1),
(60, '7lu8s0', 56, 32, 2, 25, 26, 1, 1, NULL, 3, 1, 22, 1, 1, 1, 1, 1),
(61, '38cfkco', 57, 33, 2, 26, 27, 1, 1, NULL, 3, 1, 23, 5, 14, 1, 1, 1),
(62, '2kssuj7', 58, 34, 11, 27, 28, 2, 3, NULL, 3, 4, 2, 4, 15, 2, 1, 1),
(63, '1bl72ji', 59, 35, 12, 28, 29, 1, 1, NULL, 2, 1, 24, 1, 1, 1, 1, 1),
(64, '129b6tb', 60, 36, 2, 22, 23, 1, 1, NULL, 2, 1, 25, 7, 3, 1, 1, 1),
(65, '19vfkqh', 61, 37, 2, 22, 23, 3, 1, NULL, 2, 14, 26, 3, 3, 1, 1, 1),
(66, 'm5m5l1', 62, 38, 13, 29, 30, 1, 1, NULL, 2, 1, 27, 1, 16, 1, 1, 1),
(67, '7r5b0a', 63, 39, 2, 30, 31, 1, 1, NULL, 2, 6, 28, 1, 1, 1, 1, 1),
(68, '12n84oi', 64, 33, 12, 31, 32, 1, 1, NULL, 3, 1, 23, 5, 14, 1, 1, 1),
(69, '19hb8oi', 65, 40, 14, 32, 33, 3, 1, NULL, 3, 3, 2, 3, 3, 1, 1, 1),
(70, '3fhmnu3', 66, 38, 3, 6, 6, 1, 1, NULL, 2, 1, 27, 1, 16, 1, 1, 1),
(71, '3i04nfi', 67, 41, 15, 33, 34, 1, 1, NULL, 2, 1, 29, 1, 9, 1, 1, 1),
(72, '2j5cjsb', 68, 6, 3, 6, 6, 3, 1, NULL, 2, 3, 2, 3, 3, 1, 1, 1),
(73, '3csb8j8', 69, 42, 2, 34, 35, 1, 1, NULL, 3, 6, 30, 1, 13, 1, 1, 1),
(74, 'hg81gj', 69, 43, 2, 34, 35, 1, 1, NULL, 3, 1, 31, 6, 3, 1, 1, 1),
(75, '36plamf', 70, 38, 13, 35, 36, 1, 1, NULL, 2, 1, 27, 1, 16, 1, 1, 1),
(76, 'hhbvu5', 71, 44, 2, 3, 37, 1, 1, NULL, 3, 1, 32, 1, 1, 1, 1, 1),
(77, 'topej2', 72, 45, 2, 2, 2, 1, 1, NULL, 2, 1, 33, 5, 17, 1, 1, 1),
(78, '24u5k3o', 73, 37, 14, 32, 33, 3, 1, NULL, 2, 14, 26, 3, 3, 1, 1, 1),
(79, '3s6g4kp', 74, 46, 2, 36, 38, 1, 1, NULL, 3, 1, 34, 1, 13, 1, 1, 1),
(80, '28ielpb', 75, 47, 6, 37, 39, 1, 1, NULL, 2, 1, 35, 1, 9, 1, 1, 1),
(81, '3n6hlh8', 76, 48, 3, 38, 40, 1, 1, NULL, 2, 6, 36, 5, 6, 1, 1, 1),
(82, '1hod0ud', 77, 49, 3, 39, 41, 1, 1, NULL, 2, 11, 37, 1, 1, 3, 6, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `schema_migrations`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `schema_migrations`;
CREATE TABLE `schema_migrations` (
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `schema_migrations`
--

INSERT INTO `schema_migrations` (`name`) VALUES
('Migration_20160909120710_CreateApiKeys'),
('Migration_20160909120710_FirstMigration'),
('Migration_20160918130517_CreateClicks'),
('Migration_20160918135109_CreateConversions2'),
('Migration_20160918135327_CreateRawClicks'),
('Migration_20160918135512_CreateRefTables'),
('Migration_20160918142331_CreateDailyEntries'),
('Migration_20161003163037_AddTypeToStreams'),
('Migration_20161003163705_SyncDbSchema'),
('Migration_20161004101422_RenameStreamActionFields'),
('Migration_20161004102502_ExtractDefaultActions'),
('Migration_20161005154527_MigrateRedirectDataInStreams'),
('Migration_20161007100510_AddCollectClicksToStreams'),
('Migration_20161007163321_MigrateBotActionsToForcedActions'),
('Migration_20161008085616_AddUniqueIndexToSchemaMigrations'),
('Migration_20161012092340_CreateLanding'),
('Migration_20161019223117_GroupType'),
('Migration_20161020230734_UserCampaignPermissions'),
('Migration_20161031233854_CreateAffiliateNetwork'),
('Migration_20161104002542_LandingAddState'),
('Migration_20161105092911_AddSchemaLandingOfferToStreams'),
('Migration_20161105102135_UpdateSchemaInStreams'),
('Migration_20161107152857_CreateOffersTable'),
('Migration_20161108105014_ChangeOfferCount'),
('Migration_20161108142454_CreateStreamLandingAssociations'),
('Migration_20161108142459_CreateStreamOfferAssociations'),
('Migration_20161108190417_RenameTimestampsInLandings'),
('Migration_20161111111151_AddNameToStreams'),
('Migration_20161112142644_RenameTimestampsInNetworks'),
('Migration_20161112142645_RenameTimestampsInOffers'),
('Migration_20161114224931_RenameTimestampsInNetworks'),
('Migration_20161115111649_AddBcryptPassword'),
('Migration_20161202133027_AddIsUniqueGlobalToClicks'),
('Migration_20161202135427_AddLeadSaleRejectedRevenuesToClicks'),
('Migration_20161205104437_RenameClicksToEvents'),
('Migration_20161206231240_AddLpClickDatetime'),
('Migration_20161208160631_UpdateIndexesOfEvents'),
('Migration_20161208222930_RenameRawClicks'),
('Migration_20161210140656_RemoveCountryIdFromRefRegions'),
('Migration_20161210141020_RemoveCountryREgionFromRefCities'),
('Migration_20161212093157_CreateUserPreferences'),
('Migration_20161212104538_ExtractPreferences'),
('Migration_20161213151819_RenameQueueToDelayedTask'),
('Migration_20161214125109_RenameEventQueue'),
('Migration_20161219200151_RenameDbDraft'),
('Migration_20161220075354_AddvisitorIdToEvents'),
('Migration_20161220121100_CreateVisitors'),
('Migration_20161220122451_MigrateVisitors'),
('Migration_20161220125239_CreateRefDeviceTypes'),
('Migration_20161220125637_CreateRefConnectionTypes'),
('Migration_20161220130046_CreateDestinations'),
('Migration_20161220130444_CreateNewRefColumnsToEvents'),
('Migration_20161220130650_CreateTrafficSource'),
('Migration_20161221065433_SetDestinationDefaultNull'),
('Migration_20161221075100_RenameEventsToClicksBack'),
('Migration_20161221111103_AddVisitorIdToConversions2'),
('Migration_20161221123617_DropParentAttrFromRefs'),
('Migration_20161222121216_CreateRefSubIds'),
('Migration_20161222132145_AddOperatorIdIspIdToVisitors'),
('Migration_20161223065716_RenameCodeToVisitorCode'),
('Migration_20161223102826_MakeDefaultNullInVisitors'),
('Migration_20161223105843_RemoveVisitorFieldsFromClicks'),
('Migration_20161223113029_CreateRefSearchEngines'),
('Migration_20161223122446_CreateDestinations'),
('Migration_20161223130012_UpdateConversions2'),
('Migration_20161224103230_CreateLanguages'),
('Migration_20161224103732_RenameSeToSearchEngine'),
('Migration_20161229080919_CampaignAddTrafficSource'),
('Migration_20161229081815_FixVisitorIndex'),
('Migration_20170102101009_AddTokenToCampaigns'),
('Migration_20170103102302_AddExternalIdCreativeId'),
('Migration_20170104162554_CreateExternalIdsCreativeIds'),
('Migration_20170104181011_AddGoalsToClicks'),
('Migration_20170105063028_AddLandingClickedToClicks'),
('Migration_20170120204756_AddDefaultsToClicks'),
('Migration_20170120210133_AddSettingStatsTtl'),
('Migration_20170125162047_MakeTokenDefaultNull'),
('Migration_20170126164849_SetDefaultPostbackUrlNetworks'),
('Migration_20170126165727_SetDefaults2sPostbackInSource'),
('Migration_20170127143525_CampaignCostAuto'),
('Migration_20170130125927_OfferUpsellAuto'),
('Migration_20170131131619_AddClickCreativeExternalIdsToConversion'),
('Migration_20170202215517_CreateSessions'),
('Migration_20170203135535_CreateCronStatus'),
('Migration_20170204130131_CreateReportBookmarks'),
('Migration_20170207104307_CreateAccessTables'),
('Migration_20170207205026_RenameReportBookmarkToFavouriteReport'),
('Migration_20170209110539_MigrateUserRulesToAcl'),
('Migration_20170209161316_AddParentCampaignIdToClicks'),
('Migration_20170209161527_UpdateIndexesInClicks'),
('Migration_20170211203840_CreateAclReports'),
('Migration_20170213140641_RenameTokenToParametersInTs'),
('Migration_20170213202841_AddAdCampaignId'),
('Migration_20170213203606_CreateRefAdCampaignIds'),
('Migration_20170214143434_RenameCreativeExternalAdCampaign'),
('Migration_20170214174804_SyncFieldInConversions'),
('Migration_20170224142540_AddIndexes'),
('Migration_20170306112329_CreateAclResource'),
('Migration_20170323201853_CampaignBindVisitorLandingOffer'),
('Migration_20170324110035_IncreaseActionPayloadSize'),
('Migration_20170328155219_AffiliateNetworkOfferParam'),
('Migration_20170329080023_IncreaseDeviceTypeValueSize'),
('Migration_20170329091946_MakeValuesBinary'),
('Migration_20170330135859_MigrateResourceAcl'),
('Migration_20170403155739_AddSaleDatetimeToConversions'),
('Migration_20170406095030_ChangeTypeOfLandingClickedDatetime'),
('Migration_20170411135709_FixRejectedClicks'),
('Migration_20170413104235_AllowEmptyIp'),
('Migration_20170417101608_UpdateAclEntityNames'),
('Migration_20170418191031_MultipleAuthHash'),
('Migration_20170421142042_AddClickIndexes'),
('Migration_20170428194007_AddVisitorIndexes'),
('Migration_20170501203702_AddDomain'),
('Migration_20170502085659_CreateLabels'),
('Migration_20170502174539_FixLeadRevenue'),
('Migration_20170506193451_ConvertAclTypes'),
('Migration_20170506215758_FixVisitorIndex'),
('Migration_20170509185110_FixGroups'),
('Migration_20170511083150_UpdateIndexForLabels'),
('Migration_20170513204508_CostDecimals'),
('Migration_20170514140937_AddTrafficSourcePostbackType'),
('Migration_20170515145610_AddLandingTypeAndMacrosEnabled'),
('Migration_20170517120358_AddClickCompositeIndexes'),
('Migration_20170518095017_AllowEmptyStream'),
('Migration_20170519070632_UpdateTrafficSourceStatus'),
('Migration_20170521113756_AddStreamFilterOr'),
('Migration_20170529074640_AddClickParentSubId'),
('Migration_20170609192530_CampaignAddDomainId'),
('Migration_20170610093539_ChangeSchemaForCurl'),
('Migration_20170610102246_ChangeSchemaOffersToLandings'),
('Migration_20170719123810_OfferAddCountryAttribute'),
('Migration_20170721113953_RemoveStreamLandingOfferId'),
('Migration_20170721161927_DeleteBadDomainCampaignRef'),
('Migration_20170801222907_AddEntityNotes'),
('Migration_20170807193137_DomainAddWildCard'),
('Migration_20170808192436_IncreaseAdCampaignSize'),
('Migration_20170808235201_CreateBranding'),
('Migration_20170813111110_DenormalizeAffiliateNetwork'),
('Migration_20170816234158_MergeRefLanguage'),
('Migration_20170913132236_CreateStreamItems'),
('Migration_20171002103004_AddLandingOfferRedirectType'),
('Migration_20171018195705_ExtendExternalId'),
('Migration_20171021203304_MoveListToDbAndRedis'),
('Migration_20171028114312_AddFolderForLandings'),
('Migration_20171030121803_SetLandingActionPayloadNullable'),
('Migration_20171031182540_FixSessionExpire'),
('Migration_20171105205110_CampaignUniquenessDefault'),
('Migration_20171105214224_CampaignAddParams'),
('Migration_20171113102953_AddOfferType'),
('Migration_20171113181211_UpdateOffersAndLandersActionTypes'),
('Migration_20171124202347_RemoveLandingFolder'),
('Migration_20171204160540_MigrateOfferCountry'),
('Migration_20171213112657_AddSubId15Clicks'),
('Migration_20171213112709_AddSubId15Conversions'),
('Migration_20171218141002_ReturnUrlsForOffersAndLandings'),
('Migration_20171218153120_AddLpDir'),
('Migration_20171222190026_DisableExtraParam'),
('Migration_20180104120559_AddFavouriteToStreams'),
('Migration_20180111152054_MakeActionPayloadDefaultNull'),
('Migration_20180118121205_AddIsSidebarEnabled'),
('Migration_20180123203946_ReturnV8Urls'),
('Migration_20180330131635_AddAffiliateNetworkPullApi'),
('Migration_20180401192850_AddXRequestedWith'),
('Migration_20180427184110_AddCatchNotFoundOnCampaign'),
('Migration_20180706141520_AddDomainNotes'),
('Migration_20180913204006_GeoDbToIpV6'),
('Migration_20181108132533_UpdateColumnExistence'),
('Migration_20181112150624_AddUniquenessUseCookies'),
('Migration_20181217122224_ChangeSettingsType'),
('Migration_20181226124112_AddTrafficLossToTs'),
('Migration_20181226124411_AddTrafficLossToCampaign'),
('Migration_20181227121843_AddCapFieldsToOffers'),
('Migration_20190122134734_RemoveEnumFromMode'),
('Migration_20190125072639_FixBotStreamNameAndSchema'),
('Migration_20190125105401_RemoveAntibot'),
('Migration_20190129070615_UpdateOfferTypes'),
('Migration_20190223132533_UpdateColumnExistence'),
('Migration_20190313102422_ChangeRefSource'),
('Migration_20190320060356_Ip2locationToken'),
('Migration_20190329121835_AddLpOfferTokenTtl'),
('Migration_20190509073714_ConvertLpTokens'),
('Migration_20190514145706_ConvertOldCustomFilters'),
('Migration_20190618084422_AddOfferOvercapSettings'),
('Migration_20190622184545_UpdateGeodbSettings'),
('Migration_20190708092604_AddDomainCheckErrorColumn'),
('Migration_20191209155455_CreateThirdPartyIntegration'),
('Migration_20191209163154_CreateThirdPartyIntegrationCampaignAssociations'),
('Migration_20200120101505_UpdateIntegrationsData'),
('Migration_20200204141227_UpdateAppsFlyerIntegration'),
('Migration_20200210064255_RemovePullApi'),
('Migration_20200220124125_DisableUseCFCountry'),
('Migration_20200319131723_AddIndexParentSubIdClickLinks'),
('Migration_20200408164315_AddDefaultActionAllowed');

-- --------------------------------------------------------

--
-- Структура таблицы `schema_version`
--
-- Создание: Сен 19 2020 г., 15:02
--

DROP TABLE IF EXISTS `schema_version`;
CREATE TABLE `schema_version` (
  `version` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `schema_version`
--

INSERT INTO `schema_version` (`version`) VALUES
(102);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `keitaro_acl`
--
ALTER TABLE `keitaro_acl`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `entity_type` (`entity_type`),
  ADD KEY `access_type` (`access_type`);

--
-- Индексы таблицы `keitaro_acl_reports`
--
ALTER TABLE `keitaro_acl_reports`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `keitaro_acl_resources`
--
ALTER TABLE `keitaro_acl_resources`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `keitaro_affiliate_networks`
--
ALTER TABLE `keitaro_affiliate_networks`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `keitaro_api_keys`
--
ALTER TABLE `keitaro_api_keys`
  ADD PRIMARY KEY (`id`),
  ADD KEY `key` (`key`);

--
-- Индексы таблицы `keitaro_branding`
--
ALTER TABLE `keitaro_branding`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `keitaro_campaigns`
--
ALTER TABLE `keitaro_campaigns`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `token` (`token`),
  ADD KEY `alias` (`alias`),
  ADD KEY `state` (`state`),
  ADD KEY `group_id` (`group_id`),
  ADD KEY `traffic_source_id` (`traffic_source_id`);

--
-- Индексы таблицы `keitaro_campaign_postbacks`
--
ALTER TABLE `keitaro_campaign_postbacks`
  ADD PRIMARY KEY (`id`),
  ADD KEY `campaign_id` (`campaign_id`);

--
-- Индексы таблицы `keitaro_clicks`
--
ALTER TABLE `keitaro_clicks`
  ADD PRIMARY KEY (`click_id`),
  ADD UNIQUE KEY `sub_id` (`sub_id`),
  ADD KEY `datetime` (`datetime`),
  ADD KEY `creative_id` (`creative_id_id`),
  ADD KEY `external_id` (`external_id_id`),
  ADD KEY `landing_id` (`landing_id`),
  ADD KEY `offer_id` (`offer_id`),
  ADD KEY `stream_id` (`stream_id`),
  ADD KEY `keyword_id` (`keyword_id`),
  ADD KEY `referrer_id` (`referrer_id`),
  ADD KEY `ts_id` (`ts_id`),
  ADD KEY `sub_id_1_id` (`sub_id_1_id`),
  ADD KEY `sub_id_2_id` (`sub_id_2_id`),
  ADD KEY `sub_id_3_id` (`sub_id_3_id`),
  ADD KEY `sub_id_4_id` (`sub_id_4_id`),
  ADD KEY `sub_id_5_id` (`sub_id_5_id`),
  ADD KEY `sub_id_6_id` (`sub_id_6_id`),
  ADD KEY `sub_id_7_id` (`sub_id_7_id`),
  ADD KEY `sub_id_8_id` (`sub_id_8_id`),
  ADD KEY `sub_id_9_id` (`sub_id_9_id`),
  ADD KEY `sub_id_10_id` (`sub_id_10_id`),
  ADD KEY `destination_id` (`destination_id`),
  ADD KEY `campaign_id` (`campaign_id`),
  ADD KEY `visitor_id` (`visitor_id`),
  ADD KEY `source_id` (`source_id`),
  ADD KEY `parent_campaign_id` (`parent_campaign_id`),
  ADD KEY `search_engine_id` (`search_engine_id`),
  ADD KEY `ad_campaign_id_id` (`ad_campaign_id_id`),
  ADD KEY `campaign_id_datetime` (`campaign_id`,`datetime`),
  ADD KEY `stream_id_datetime` (`stream_id`,`datetime`),
  ADD KEY `ts_id_datetime` (`ts_id`,`datetime`),
  ADD KEY `landing_id_datetime` (`landing_id`,`datetime`),
  ADD KEY `offer_id_datetime` (`offer_id`,`datetime`),
  ADD KEY `affiliate_network_id` (`affiliate_network_id`),
  ADD KEY `sub_id_11_id` (`sub_id_11_id`),
  ADD KEY `sub_id_12_id` (`sub_id_12_id`),
  ADD KEY `sub_id_13_id` (`sub_id_13_id`),
  ADD KEY `sub_id_14_id` (`sub_id_14_id`),
  ADD KEY `sub_id_15_id` (`sub_id_15_id`),
  ADD KEY `x_requested_with_id` (`x_requested_with_id`);

--
-- Индексы таблицы `keitaro_click_links`
--
ALTER TABLE `keitaro_click_links`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `sub_ids` (`sub_id`,`parent_sub_id`),
  ADD KEY `parent_sub_id` (`parent_sub_id`);

--
-- Индексы таблицы `keitaro_command_queue`
--
ALTER TABLE `keitaro_command_queue`
  ADD PRIMARY KEY (`id`),
  ADD KEY `created_at` (`created_at`);

--
-- Индексы таблицы `keitaro_conversions`
--
ALTER TABLE `keitaro_conversions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `sub_id_tid` (`sub_id`,`tid`),
  ADD KEY `campaign_id` (`campaign_id`);

--
-- Индексы таблицы `keitaro_conversions_2`
--
ALTER TABLE `keitaro_conversions_2`
  ADD PRIMARY KEY (`conversion_id`),
  ADD UNIQUE KEY `sub_id_tid` (`sub_id`,`tid`),
  ADD KEY `campaign_id` (`campaign_id`),
  ADD KEY `affiliate_network_id` (`affiliate_network_id`),
  ADD KEY `x_requested_with_id` (`x_requested_with_id`);

--
-- Индексы таблицы `keitaro_country_profiles`
--
ALTER TABLE `keitaro_country_profiles`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `keitaro_cron_status`
--
ALTER TABLE `keitaro_cron_status`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `task_name` (`task_name`);

--
-- Индексы таблицы `keitaro_daily_entries`
--
ALTER TABLE `keitaro_daily_entries`
  ADD PRIMARY KEY (`entry_id`),
  ADD UNIQUE KEY `date_campaign_name_value` (`date`,`campaign_id`,`field_name`,`field_value`);

--
-- Индексы таблицы `keitaro_delayed_tasks`
--
ALTER TABLE `keitaro_delayed_tasks`
  ADD PRIMARY KEY (`id`),
  ADD KEY `status` (`status`);

--
-- Индексы таблицы `keitaro_domains`
--
ALTER TABLE `keitaro_domains`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `keitaro_favourite_reports`
--
ALTER TABLE `keitaro_favourite_reports`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `keitaro_favourite_streams`
--
ALTER TABLE `keitaro_favourite_streams`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `user_id_stream_id` (`user_id`,`stream_id`);

--
-- Индексы таблицы `keitaro_groups`
--
ALTER TABLE `keitaro_groups`
  ADD PRIMARY KEY (`id`),
  ADD KEY `position` (`position`);

--
-- Индексы таблицы `keitaro_ips`
--
ALTER TABLE `keitaro_ips`
  ADD PRIMARY KEY (`id`),
  ADD KEY `ip` (`ip`),
  ADD KEY `campaign_id` (`campaign_id`);

--
-- Индексы таблицы `keitaro_ip_sessions`
--
ALTER TABLE `keitaro_ip_sessions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `ip` (`ip`);

--
-- Индексы таблицы `keitaro_labels`
--
ALTER TABLE `keitaro_labels`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `campaign_name_id` (`campaign_id`,`ref_name`,`ref_id`),
  ADD KEY `label_name` (`label_name`),
  ADD KEY `campaign_id` (`campaign_id`),
  ADD KEY `ref_name` (`ref_name`),
  ADD KEY `ref_id` (`ref_id`);

--
-- Индексы таблицы `keitaro_landings`
--
ALTER TABLE `keitaro_landings`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `keitaro_monitoring_history`
--
ALTER TABLE `keitaro_monitoring_history`
  ADD PRIMARY KEY (`id`),
  ADD KEY `trigger_id` (`trigger_id`),
  ADD KEY `stream_id` (`stream_id`),
  ADD KEY `state` (`state`);

--
-- Индексы таблицы `keitaro_offers`
--
ALTER TABLE `keitaro_offers`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `keitaro_ref_ad_campaign_ids`
--
ALTER TABLE `keitaro_ref_ad_campaign_ids`
  ADD PRIMARY KEY (`id`),
  ADD KEY `value` (`value`);

--
-- Индексы таблицы `keitaro_ref_browsers`
--
ALTER TABLE `keitaro_ref_browsers`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `value` (`value`);

--
-- Индексы таблицы `keitaro_ref_browser_versions`
--
ALTER TABLE `keitaro_ref_browser_versions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `browser_id_value` (`value`);

--
-- Индексы таблицы `keitaro_ref_cities`
--
ALTER TABLE `keitaro_ref_cities`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `region_id_value` (`value`);

--
-- Индексы таблицы `keitaro_ref_connection_types`
--
ALTER TABLE `keitaro_ref_connection_types`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `value` (`value`);

--
-- Индексы таблицы `keitaro_ref_countries`
--
ALTER TABLE `keitaro_ref_countries`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `value` (`value`);

--
-- Индексы таблицы `keitaro_ref_creative_ids`
--
ALTER TABLE `keitaro_ref_creative_ids`
  ADD PRIMARY KEY (`id`),
  ADD KEY `value` (`value`);

--
-- Индексы таблицы `keitaro_ref_destinations`
--
ALTER TABLE `keitaro_ref_destinations`
  ADD PRIMARY KEY (`id`),
  ADD KEY `value` (`value`);

--
-- Индексы таблицы `keitaro_ref_device_models`
--
ALTER TABLE `keitaro_ref_device_models`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `value` (`value`);

--
-- Индексы таблицы `keitaro_ref_device_types`
--
ALTER TABLE `keitaro_ref_device_types`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `value` (`value`);

--
-- Индексы таблицы `keitaro_ref_external_ids`
--
ALTER TABLE `keitaro_ref_external_ids`
  ADD PRIMARY KEY (`id`),
  ADD KEY `value` (`value`(255));

--
-- Индексы таблицы `keitaro_ref_ips`
--
ALTER TABLE `keitaro_ref_ips`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `value` (`value`);

--
-- Индексы таблицы `keitaro_ref_isp`
--
ALTER TABLE `keitaro_ref_isp`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `value` (`value`);

--
-- Индексы таблицы `keitaro_ref_keywords`
--
ALTER TABLE `keitaro_ref_keywords`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `value` (`value`);

--
-- Индексы таблицы `keitaro_ref_languages`
--
ALTER TABLE `keitaro_ref_languages`
  ADD PRIMARY KEY (`id`),
  ADD KEY `value` (`value`);

--
-- Индексы таблицы `keitaro_ref_operators`
--
ALTER TABLE `keitaro_ref_operators`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `value` (`value`);

--
-- Индексы таблицы `keitaro_ref_os`
--
ALTER TABLE `keitaro_ref_os`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `value` (`value`);

--
-- Индексы таблицы `keitaro_ref_os_versions`
--
ALTER TABLE `keitaro_ref_os_versions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `os_id_value` (`value`);

--
-- Индексы таблицы `keitaro_ref_params`
--
ALTER TABLE `keitaro_ref_params`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `param_name_value` (`id`,`name`,`value`);

--
-- Индексы таблицы `keitaro_ref_referrers`
--
ALTER TABLE `keitaro_ref_referrers`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `value` (`value`);

--
-- Индексы таблицы `keitaro_ref_regions`
--
ALTER TABLE `keitaro_ref_regions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `country_id_value` (`value`);

--
-- Индексы таблицы `keitaro_ref_search_engines`
--
ALTER TABLE `keitaro_ref_search_engines`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `value` (`value`);

--
-- Индексы таблицы `keitaro_ref_sources`
--
ALTER TABLE `keitaro_ref_sources`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `value` (`value`);

--
-- Индексы таблицы `keitaro_ref_sub_ids`
--
ALTER TABLE `keitaro_ref_sub_ids`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `value` (`value`);

--
-- Индексы таблицы `keitaro_ref_user_agents`
--
ALTER TABLE `keitaro_ref_user_agents`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `value` (`value`);

--
-- Индексы таблицы `keitaro_ref_x_requested_with`
--
ALTER TABLE `keitaro_ref_x_requested_with`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `value` (`value`);

--
-- Индексы таблицы `keitaro_report_bookmarks`
--
ALTER TABLE `keitaro_report_bookmarks`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `keitaro_requests`
--
ALTER TABLE `keitaro_requests`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `keitaro_sales`
--
ALTER TABLE `keitaro_sales`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `group_stream_sub` (`group_id`,`stream_id`,`sub_id`),
  ADD KEY `sub_id` (`sub_id`),
  ADD KEY `campaign_id` (`campaign_id`);

--
-- Индексы таблицы `keitaro_sessions`
--
ALTER TABLE `keitaro_sessions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `visitor_code` (`visitor_code`),
  ADD KEY `expires_at` (`expires_at`);

--
-- Индексы таблицы `keitaro_settings`
--
ALTER TABLE `keitaro_settings`
  ADD PRIMARY KEY (`key`);

--
-- Индексы таблицы `keitaro_shards`
--
ALTER TABLE `keitaro_shards`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `date` (`date`);

--
-- Индексы таблицы `keitaro_streams`
--
ALTER TABLE `keitaro_streams`
  ADD PRIMARY KEY (`id`),
  ADD KEY `position` (`position`),
  ADD KEY `state` (`state`),
  ADD KEY `campaign_id` (`campaign_id`);

--
-- Индексы таблицы `keitaro_stream_filters`
--
ALTER TABLE `keitaro_stream_filters`
  ADD PRIMARY KEY (`id`),
  ADD KEY `stream_id` (`stream_id`);

--
-- Индексы таблицы `keitaro_stream_groups`
--
ALTER TABLE `keitaro_stream_groups`
  ADD PRIMARY KEY (`id`),
  ADD KEY `type` (`type`),
  ADD KEY `status` (`status`),
  ADD KEY `key` (`key`),
  ADD KEY `state` (`state`);

--
-- Индексы таблицы `keitaro_stream_landing_associations`
--
ALTER TABLE `keitaro_stream_landing_associations`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `stream_landing` (`stream_id`,`landing_id`);

--
-- Индексы таблицы `keitaro_stream_offer_associations`
--
ALTER TABLE `keitaro_stream_offer_associations`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `stream_offer` (`stream_id`,`offer_id`);

--
-- Индексы таблицы `keitaro_third_party_integration`
--
ALTER TABLE `keitaro_third_party_integration`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `keitaro_third_party_integration_campaign_associations`
--
ALTER TABLE `keitaro_third_party_integration_campaign_associations`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `integration_campaign` (`integration_id`,`campaign_id`);

--
-- Индексы таблицы `keitaro_traffic_sources`
--
ALTER TABLE `keitaro_traffic_sources`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `keitaro_triggers`
--
ALTER TABLE `keitaro_triggers`
  ADD PRIMARY KEY (`id`),
  ADD KEY `enabled` (`enabled`);

--
-- Индексы таблицы `keitaro_users`
--
ALTER TABLE `keitaro_users`
  ADD PRIMARY KEY (`id`),
  ADD KEY `login` (`login`,`password`),
  ADD KEY `type` (`type`);

--
-- Индексы таблицы `keitaro_user_bot_ips`
--
ALTER TABLE `keitaro_user_bot_ips`
  ADD PRIMARY KEY (`id`),
  ADD KEY `ips` (`min_ip`,`max_ip`);

--
-- Индексы таблицы `keitaro_user_campaign_permissions`
--
ALTER TABLE `keitaro_user_campaign_permissions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id_campaign_id_idx` (`user_id`,`campaign_id`);

--
-- Индексы таблицы `keitaro_user_password_hashes`
--
ALTER TABLE `keitaro_user_password_hashes`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `keitaro_user_preferences`
--
ALTER TABLE `keitaro_user_preferences`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `user_id_pref_name` (`user_id`,`pref_name`);

--
-- Индексы таблицы `keitaro_visitors`
--
ALTER TABLE `keitaro_visitors`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `code` (`visitor_code`),
  ADD KEY `user_agent_id` (`user_agent_id`),
  ADD KEY `ip_id` (`ip_id`),
  ADD KEY `country_id` (`country_id`),
  ADD KEY `region_id` (`region_id`),
  ADD KEY `city_id` (`city_id`),
  ADD KEY `device_type_id` (`device_type_id`),
  ADD KEY `device_model_id` (`device_model_id`),
  ADD KEY `operator_id` (`operator_id`),
  ADD KEY `isp_id` (`isp_id`),
  ADD KEY `os_version_id` (`os_version_id`),
  ADD KEY `screen_id` (`screen_id`),
  ADD KEY `language_id` (`language_id`),
  ADD KEY `browser_id` (`browser_id`),
  ADD KEY `os_id` (`os_id`),
  ADD KEY `connection_type_id` (`connection_type_id`),
  ADD KEY `browser_version_id` (`browser_version_id`);

--
-- Индексы таблицы `schema_migrations`
--
ALTER TABLE `schema_migrations`
  ADD UNIQUE KEY `name` (`name`);

--
-- Индексы таблицы `schema_version`
--
ALTER TABLE `schema_version`
  ADD PRIMARY KEY (`version`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `keitaro_acl`
--
ALTER TABLE `keitaro_acl`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_acl_reports`
--
ALTER TABLE `keitaro_acl_reports`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_acl_resources`
--
ALTER TABLE `keitaro_acl_resources`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_affiliate_networks`
--
ALTER TABLE `keitaro_affiliate_networks`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_api_keys`
--
ALTER TABLE `keitaro_api_keys`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_branding`
--
ALTER TABLE `keitaro_branding`
  MODIFY `id` int(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_campaigns`
--
ALTER TABLE `keitaro_campaigns`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `keitaro_campaign_postbacks`
--
ALTER TABLE `keitaro_campaign_postbacks`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_clicks`
--
ALTER TABLE `keitaro_clicks`
  MODIFY `click_id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=157;

--
-- AUTO_INCREMENT для таблицы `keitaro_click_links`
--
ALTER TABLE `keitaro_click_links`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_command_queue`
--
ALTER TABLE `keitaro_command_queue`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_conversions`
--
ALTER TABLE `keitaro_conversions`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_conversions_2`
--
ALTER TABLE `keitaro_conversions_2`
  MODIFY `conversion_id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_country_profiles`
--
ALTER TABLE `keitaro_country_profiles`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT для таблицы `keitaro_cron_status`
--
ALTER TABLE `keitaro_cron_status`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT для таблицы `keitaro_daily_entries`
--
ALTER TABLE `keitaro_daily_entries`
  MODIFY `entry_id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_delayed_tasks`
--
ALTER TABLE `keitaro_delayed_tasks`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_domains`
--
ALTER TABLE `keitaro_domains`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_favourite_reports`
--
ALTER TABLE `keitaro_favourite_reports`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_favourite_streams`
--
ALTER TABLE `keitaro_favourite_streams`
  MODIFY `id` int(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_groups`
--
ALTER TABLE `keitaro_groups`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_ips`
--
ALTER TABLE `keitaro_ips`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_ip_sessions`
--
ALTER TABLE `keitaro_ip_sessions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_labels`
--
ALTER TABLE `keitaro_labels`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_landings`
--
ALTER TABLE `keitaro_landings`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_monitoring_history`
--
ALTER TABLE `keitaro_monitoring_history`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_offers`
--
ALTER TABLE `keitaro_offers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_ad_campaign_ids`
--
ALTER TABLE `keitaro_ref_ad_campaign_ids`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_browsers`
--
ALTER TABLE `keitaro_ref_browsers`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_browser_versions`
--
ALTER TABLE `keitaro_ref_browser_versions`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_cities`
--
ALTER TABLE `keitaro_ref_cities`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=42;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_connection_types`
--
ALTER TABLE `keitaro_ref_connection_types`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_countries`
--
ALTER TABLE `keitaro_ref_countries`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_creative_ids`
--
ALTER TABLE `keitaro_ref_creative_ids`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_destinations`
--
ALTER TABLE `keitaro_ref_destinations`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_device_models`
--
ALTER TABLE `keitaro_ref_device_models`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_device_types`
--
ALTER TABLE `keitaro_ref_device_types`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_external_ids`
--
ALTER TABLE `keitaro_ref_external_ids`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_ips`
--
ALTER TABLE `keitaro_ref_ips`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=78;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_isp`
--
ALTER TABLE `keitaro_ref_isp`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_keywords`
--
ALTER TABLE `keitaro_ref_keywords`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_languages`
--
ALTER TABLE `keitaro_ref_languages`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_operators`
--
ALTER TABLE `keitaro_ref_operators`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_os`
--
ALTER TABLE `keitaro_ref_os`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_os_versions`
--
ALTER TABLE `keitaro_ref_os_versions`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_params`
--
ALTER TABLE `keitaro_ref_params`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_referrers`
--
ALTER TABLE `keitaro_ref_referrers`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_regions`
--
ALTER TABLE `keitaro_ref_regions`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=40;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_search_engines`
--
ALTER TABLE `keitaro_ref_search_engines`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_sources`
--
ALTER TABLE `keitaro_ref_sources`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_sub_ids`
--
ALTER TABLE `keitaro_ref_sub_ids`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_user_agents`
--
ALTER TABLE `keitaro_ref_user_agents`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=50;

--
-- AUTO_INCREMENT для таблицы `keitaro_ref_x_requested_with`
--
ALTER TABLE `keitaro_ref_x_requested_with`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `keitaro_report_bookmarks`
--
ALTER TABLE `keitaro_report_bookmarks`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_requests`
--
ALTER TABLE `keitaro_requests`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_sales`
--
ALTER TABLE `keitaro_sales`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_sessions`
--
ALTER TABLE `keitaro_sessions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_shards`
--
ALTER TABLE `keitaro_shards`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_streams`
--
ALTER TABLE `keitaro_streams`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `keitaro_stream_filters`
--
ALTER TABLE `keitaro_stream_filters`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT для таблицы `keitaro_stream_groups`
--
ALTER TABLE `keitaro_stream_groups`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_stream_landing_associations`
--
ALTER TABLE `keitaro_stream_landing_associations`
  MODIFY `id` int(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_stream_offer_associations`
--
ALTER TABLE `keitaro_stream_offer_associations`
  MODIFY `id` int(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `keitaro_third_party_integration`
--
ALTER TABLE `keitaro_third_party_integration`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_third_party_integration_campaign_associations`
--
ALTER TABLE `keitaro_third_party_integration_campaign_associations`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT для таблицы `keitaro_traffic_sources`
--
ALTER TABLE `keitaro_traffic_sources`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `keitaro_triggers`
--
ALTER TABLE `keitaro_triggers`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_users`
--
ALTER TABLE `keitaro_users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `keitaro_user_bot_ips`
--
ALTER TABLE `keitaro_user_bot_ips`
  MODIFY `id` int(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_user_campaign_permissions`
--
ALTER TABLE `keitaro_user_campaign_permissions`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `keitaro_user_password_hashes`
--
ALTER TABLE `keitaro_user_password_hashes`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT для таблицы `keitaro_user_preferences`
--
ALTER TABLE `keitaro_user_preferences`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT для таблицы `keitaro_visitors`
--
ALTER TABLE `keitaro_visitors`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=83;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
